RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_lvdsss.h
/***************************************************************************//**
* \file cyip_lvdsss.h
*
* \brief
* LVDSSS IP definitions
*
********************************************************************************
* \copyright
* (c) (2016-2025), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#ifndef _CYIP_LVDSSS_H_
#define _CYIP_LVDSSS_H_

#include "cyip_headers.h"

/*******************************************************************************
*                                    LVDSSS
*******************************************************************************/

#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_SECTION_SIZE 0x00000020UL
#define LVDSSS_LVDS_THREAD_SECTION_SIZE         0x00000200UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_SECTION_SIZE 0x00000010UL
#define LVDSSS_LVDS_GPIF_LEFT_SECTION_SIZE      0x00001000UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_SECTION_SIZE 0x00000010UL
#define LVDSSS_LVDS_GPIF_RIGHT_SECTION_SIZE     0x00001000UL
#define LVDSSS_LVDS_GPIF_SECTION_SIZE           0x00003000UL
#define LVDSSS_LVDS_AFE_SECTION_SIZE            0x00000800UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_SECTION_SIZE 0x00000080UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_SECTION_SIZE 0x00000100UL
#define LVDSSS_LVDS_ADAPTER_DMA_SECTION_SIZE    0x00010000UL
#define LVDSSS_LVDS_SECTION_SIZE                0x00040000UL
#define LVDSSS_SECTION_SIZE                     0x00040000UL

/**
  * \brief LVDS Low power and Wakeup Interrupt registers (LVDSSS_LVDS_LVDS_LOW_PWR_INTR)
  */
typedef struct {
  __IOM uint32_t LVDS_WAKEUP_INTR;              /*!< 0x00000000 LVDS_WAKEUP Interrupt Request Register */
  __IOM uint32_t LVDS_WAKEUP_INTR_MASK;         /*!< 0x00000004 LVDS_WAKEUP Interrupt Mask Register */
   __IM uint32_t LVDS_WAKEUP_INTR_MASKED;       /*!< 0x00000008 LVDS_WAKEUP Interrupt Generator */
  __IOM uint32_t LVDS_WAKEUP_INTR_SET;          /*!< 0x0000000C LVDS_WAKEUP Interrupt Set Register */
  __IOM uint32_t LOW_PWR_CTL[2];                /*!< 0x00000010 Low power mode control register */
   __IM uint32_t RESERVED[2];
} LVDSSS_LVDS_LVDS_LOW_PWR_INTR_V1_Type;        /*!< Size = 32 (0x20) */

/**
  * \brief Set of registers for a thread (LVDSSS_LVDS_THREAD)
  */
typedef struct {
  __IOM uint32_t GPIF_DATA_CTRL;                /*!< 0x00000000 Data Control Register */
   __IM uint32_t GPIF_INGRESS_DATA_WORD0;       /*!< 0x00000004 Socket Ingress Data */
   __IM uint32_t GPIF_INGRESS_DATA_WORD1;       /*!< 0x00000008 Socket Ingress Data */
   __IM uint32_t GPIF_INGRESS_DATA_WORD2;       /*!< 0x0000000C Socket Ingress Data */
   __IM uint32_t GPIF_INGRESS_DATA_WORD3;       /*!< 0x00000010 Socket Ingress Data */
  __IOM uint32_t GPIF_EGRESS_DATA_WORD0;        /*!< 0x00000014 Socket Egress Data */
  __IOM uint32_t GPIF_EGRESS_DATA_WORD1;        /*!< 0x00000018 Socket Egress Data */
   __IM uint32_t GPIF_INGRESS_ADDRESS;          /*!< 0x0000001C Thread Ingress Address */
  __IOM uint32_t GPIF_EGRESS_ADDRESS;           /*!< 0x00000020 Thread Egress Address */
  __IOM uint32_t GPIF_THREAD_CONFIG;            /*!< 0x00000024 Thread Configuration Register */
   __IM uint32_t RESERVED;
   __IM uint32_t VARW0;                         /*!< 0x0000002C Variable Register */
   __IM uint32_t VARW1;                         /*!< 0x00000030 Variable Register */
   __IM uint32_t PTSSS;                         /*!< 0x00000034 PTS snapshot register */
   __IM uint32_t SCRSS_DW0;                     /*!< 0x00000038 SCR snapshot register */
   __IM uint32_t SCRSS_DW1;                     /*!< 0x0000003C SCR snapshot register */
   __IM uint32_t HDR_FLGS;                      /*!< 0x00000040 Header Flags */
   __IM uint32_t RESERVED1[3];
   __IM uint32_t EVC_VAR0_DW0;                  /*!< 0x00000050 Event Count Variable0 */
   __IM uint32_t EVC_VAR0_DW1;                  /*!< 0x00000054 Event Count Variable0 */
   __IM uint32_t EVC_VAR1_DW0;                  /*!< 0x00000058 Event Count Variable1 */
   __IM uint32_t EVC_VAR1_DW1;                  /*!< 0x0000005C Event Count Variable1 */
   __IM uint32_t PLC_DW0;                       /*!< 0x00000060 Payload Count register */
   __IM uint32_t PLC_DW1;                       /*!< 0x00000064 Payload Count register */
  __IOM uint32_t PAYLOAD_CFG;                   /*!< 0x00000068 Payload Config register */
   __IM uint32_t RESERVED2;
  __IOM uint32_t DCRC_CONFIG;                   /*!< 0x00000070 Data CRC Configuration register */
  __IOM uint32_t DCRC;                          /*!< 0x00000074 Data CRC */
  __IOM uint32_t DCRC_STS;                      /*!< 0x00000078 Data CRC status */
   __IM uint32_t RESERVED3;
  __IOM uint32_t MCRC_CONFIG;                   /*!< 0x00000080 MetaData(or Header) CRC Configuration register */
  __IOM uint32_t MCRC;                          /*!< 0x00000084 MetaData CRC */
  __IOM uint32_t THREAD_DMA_INTF_CFG;           /*!< 0x00000088 Thread controller DMA interface configuration */
   __IM uint32_t RESERVED4;
  __IOM uint32_t MD0_CTRL;                      /*!< 0x00000090 Metadata-0 Control word */
  __IOM uint32_t MD1_CTRL;                      /*!< 0x00000094 Metadata-1 Control word */
  __IOM uint32_t MD2_CTRL;                      /*!< 0x00000098 Metadata-2 Control word */
  __IOM uint32_t MD3_CTRL;                      /*!< 0x0000009C Metadata-3 Control word */
   __IM uint32_t RESERVED5[88];
} LVDSSS_LVDS_THREAD_V1_Type;                   /*!< Size = 512 (0x200) */

/**
  * \brief GPIF  Waveform registers (LVDSSS_LVDS_GPIF_LEFT_WAVEFORM)
  */
typedef struct {
  __IOM uint32_t WAVEFORM0;                     /*!< 0x00000000 GPIF state definition */
  __IOM uint32_t WAVEFORM1;                     /*!< 0x00000004 GPIF state definition */
  __IOM uint32_t WAVEFORM2;                     /*!< 0x00000008 GPIF state definition */
  __IOM uint32_t WAVEFORM3;                     /*!< 0x0000000C GPIF state definition */
} LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_V1_Type;       /*!< Size = 16 (0x10) */

/**
  * \brief GPIF State Machine Left Waveform memory (LVDSSS_LVDS_GPIF_LEFT)
  */
typedef struct {
        LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_V1_Type WAVEFORM[256]; /*!< 0x00000000 GPIF  Waveform registers */
} LVDSSS_LVDS_GPIF_LEFT_V1_Type;                /*!< Size = 4096 (0x1000) */

/**
  * \brief GPIF  Waveform registers (LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM)
  */
typedef struct {
  __IOM uint32_t WAVEFORM0;                     /*!< 0x00000000 GPIF state definition */
  __IOM uint32_t WAVEFORM1;                     /*!< 0x00000004 GPIF state definition */
  __IOM uint32_t WAVEFORM2;                     /*!< 0x00000008 GPIF state definition */
  __IOM uint32_t WAVEFORM3;                     /*!< 0x0000000C GPIF state definition */
} LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_V1_Type;      /*!< Size = 16 (0x10) */

/**
  * \brief GPIF State Machine Right Waveform memory. (LVDSSS_LVDS_GPIF_RIGHT)
  */
typedef struct {
        LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_V1_Type WAVEFORM[256]; /*!< 0x00000000 GPIF  Waveform registers */
} LVDSSS_LVDS_GPIF_RIGHT_V1_Type;               /*!< Size = 4096 (0x1000) */

/**
  * \brief GPIF-II Configuration Registers (LVDSSS_LVDS_GPIF)
  */
typedef struct {
  __IOM uint32_t GPIF_CONFIG;                   /*!< 0x00000000 GPIF Configuration Register */
  __IOM uint32_t GPIF_BUS_CONFIG;               /*!< 0x00000004 Bus Configuration Register */
  __IOM uint32_t GPIF_BUS_CONFIG2;              /*!< 0x00000008 Bus Configuration Register #2 */
  __IOM uint32_t GPIF_AD_CONFIG;                /*!< 0x0000000C Address/Data configuration register */
  __IOM uint32_t GPIF_CTL_FUNC0;                /*!< 0x00000010 CTL pin functional usage register #0 */
  __IOM uint32_t GPIF_CTL_FUNC1;                /*!< 0x00000014 CTL pin functional usage register #1 */
  __IOM uint32_t GPIF_CTL_FUNC2;                /*!< 0x00000018 CTL pin functional usage register #2 */
  __IOM uint32_t GPIF_CTL_FUNC3;                /*!< 0x0000001C CTL pin functional usage register #3 */
  __IOM uint32_t GPIF_CTL_FUNC4;                /*!< 0x00000020 CTL pin functional usage register #4 */
   __IM uint32_t GPIF_STATUS;                   /*!< 0x00000024 GPIF Status Register */
   __IM uint32_t RESERVED[2];
  __IOM uint32_t GPIF_INTR;                     /*!< 0x00000030 GPIF Interrupt Request Register */
  __IOM uint32_t GPIF_INTR_MASK;                /*!< 0x00000034 GPIF Interrupt Mask Register */
   __IM uint32_t GPIF_INTR_MASKED;              /*!< 0x00000038 GPIF Interrupt Generator */
  __IOM uint32_t GPIF_INTR_SET;                 /*!< 0x0000003C GPIF Interrupt Set Register */
   __IM uint32_t GPIF_ERROR;                    /*!< 0x00000040 GPIF Error Register */
   __IM uint32_t RESERVED1[3];
  __IOM uint32_t GPIF_CTRL_BUS_DIRECTION[20];   /*!< 0x00000050 Control Bus in/out direction */
   __IM uint32_t RESERVED2[4];
  __IOM uint32_t GPIF_CTRL_BUS_DEFAULT;         /*!< 0x000000B0 Control bus default values */
  __IOM uint32_t GPIF_CTRL_BUS_POLARITY;        /*!< 0x000000B4 Control bus signal polarity */
  __IOM uint32_t GPIF_CTRL_BUS_TOGGLE;          /*!< 0x000000B8 Control bus output toggle mode */
   __IM uint32_t RESERVED3[17];
  __IOM uint32_t GPIF_CTRL_BUS_SELECT[20];      /*!< 0x00000100 Control bus connection matrix register */
   __IM uint32_t RESERVED4[4];
  __IOM uint32_t GPIF_CTRL_COUNT_CONFIG;        /*!< 0x00000160 Control counter configuration */
  __IOM uint32_t GPIF_CTRL_COUNT_RESET;         /*!< 0x00000164 Control counter reset register */
  __IOM uint32_t GPIF_CTRL_COUNT_LIMIT;         /*!< 0x00000168 Control counter limit register */
   __IM uint32_t RESERVED5;
  __IOM uint32_t GPIF_ADDR_COUNT_CONFIG;        /*!< 0x00000170 Address counter configuration */
  __IOM uint32_t GPIF_ADDR_COUNT_RESET;         /*!< 0x00000174 Address counter reset register */
  __IOM uint32_t GPIF_ADDR_COUNT_LIMIT;         /*!< 0x00000178 Address counter limit register */
   __IM uint32_t RESERVED6;
  __IOM uint32_t GPIF_STATE_COUNT_CONFIG;       /*!< 0x00000180 State counter configuration */
  __IOM uint32_t GPIF_STATE_COUNT_LIMIT;        /*!< 0x00000184 State counter limit register */
   __IM uint32_t RESERVED7[2];
  __IOM uint32_t GPIF_DATA_COUNT_CONFIG;        /*!< 0x00000190 Data counter configuration */
  __IOM uint32_t GPIF_DATA_COUNT_RESET_LSB;     /*!< 0x00000194 Data counter reset register */
   __IM uint32_t RESERVED8;
  __IOM uint32_t GPIF_DATA_COUNT_RESET_MSB;     /*!< 0x0000019C Data counter reset register */
  __IOM uint32_t GPIF_DATA_COUNT_LIMIT_LSB;     /*!< 0x000001A0 Data counter limit register */
  __IOM uint32_t GPIF_DATA_COUNT_LIMIT_MSB;     /*!< 0x000001A4 Data counter limit register */
  __IOM uint32_t GPIF_CTRL_COMP_VALUE;          /*!< 0x000001A8 Control comparator value */
  __IOM uint32_t GPIF_CTRL_COMP_MASK;           /*!< 0x000001AC Control comparator mask */
  __IOM uint32_t GPIF_DATA_COMP_VALUE_WORD0;    /*!< 0x000001B0 Data comparator value */
  __IOM uint32_t GPIF_DATA_COMP_VALUE_WORD1;    /*!< 0x000001B4 Data comparator value */
  __IOM uint32_t GPIF_DATA_COMP_VALUE_WORD2;    /*!< 0x000001B8 Data comparator value */
  __IOM uint32_t GPIF_DATA_COMP_VALUE_WORD3;    /*!< 0x000001BC Data comparator value */
   __IM uint32_t RESERVED9[4];
  __IOM uint32_t GPIF_DATA_COMP_MASK_WORD0;     /*!< 0x000001D0 Data comparator mask */
  __IOM uint32_t GPIF_DATA_COMP_MASK_WORD1;     /*!< 0x000001D4 Data comparator mask */
  __IOM uint32_t GPIF_DATA_COMP_MASK_WORD2;     /*!< 0x000001D8 Data comparator mask */
  __IOM uint32_t GPIF_DATA_COMP_MASK_WORD3;     /*!< 0x000001DC Data comparator mask */
  __IOM uint32_t GPIF_ADDR_COMP_VALUE;          /*!< 0x000001E0 Address comparator value */
  __IOM uint32_t GPIF_ADDR_COMP_MASK;           /*!< 0x000001E4 Address comparator mask */
   __IM uint32_t RESERVED10[2];
   __IM uint32_t GPIF_LAMBDA_STAT0;             /*!< 0x000001F0 Lambda Status Register */
   __IM uint32_t GPIF_LAMBDA_STAT1;             /*!< 0x000001F4 Lambda Status Register */
   __IM uint32_t GPIF_ALPHA_STAT;               /*!< 0x000001F8 Alpha Status Register */
   __IM uint32_t GPIF_BETA_STAT;                /*!< 0x000001FC Beta Status Register */
  __IOM uint32_t GPIF_WAVEFORM_CTRL_STAT;       /*!< 0x00000200 Waveform program control */
  __IOM uint32_t GPIF_WAVEFORM_SWITCH;          /*!< 0x00000204 Waveform switch control */
  __IOM uint32_t GPIF_WAVEFORM_SWITCH_TIMEOUT;  /*!< 0x00000208 Waveform timeout register */
   __IM uint32_t RESERVED11;
  __IOM uint32_t GPIF_CRC_CALC_CONFIG;          /*!< 0x00000210 CRC Calculate Configuration Register */
   __IM uint32_t RESERVED12;
  __IOM uint32_t GPIF_BETA_DEASSERT;            /*!< 0x00000218 Beta Deassert Register */
   __IM uint32_t RESERVED13;
  __IOM uint32_t GPIF_FUNCTION[32];             /*!< 0x00000220 Transition Function Registers */
   __IM uint32_t RESERVED14[4];
  __IOM uint32_t LINK_IDLE_CFG;                 /*!< 0x000002B0 Link Idle Config register */
   __IM uint32_t RESERVED15[3];
  __IOM uint32_t LVCMOS_CLK_OUT_CFG;            /*!< 0x000002C0 lvcmos clock out config register */
   __IM uint32_t RESERVED16[847];
        LVDSSS_LVDS_GPIF_LEFT_V1_Type LEFT;     /*!< 0x00001000 GPIF State Machine Left Waveform memory */
        LVDSSS_LVDS_GPIF_RIGHT_V1_Type RIGHT;   /*!< 0x00002000 GPIF State Machine Right Waveform memory. */
} LVDSSS_LVDS_GPIF_V1_Type;                     /*!< Size = 12288 (0x3000) */

/**
  * \brief Phy Configuration Registers (LVDSSS_LVDS_AFE)
  */
typedef struct {
  __IOM uint32_t DLL_DFTLPF;                    /*!< 0x00000000 DLL Low-Pass Filter Config Register */
  __IOM uint32_t DLL_CONFIG;                    /*!< 0x00000004 DLL Configuration Register */
   __IM uint32_t DLL_STATUS;                    /*!< 0x00000008 DLL Status Register */
  __IOM uint32_t DLL_M_CONFIG;                  /*!< 0x0000000C Master DLL Config Register */
   __IM uint32_t DLL_M_STATUS;                  /*!< 0x00000010 Master DLL Status Register */
  __IOM uint32_t DLL_S_CONFIG[12];              /*!< 0x00000014 Slave DLL Configuration */
   __IM uint32_t RESERVED[3];
   __IM uint32_t DLL_S_STATUS[12];              /*!< 0x00000050 Slave DLL Status */
  __IOM uint32_t GENERAL_LICIO_CIO;             /*!< 0x00000080 LICIO_CIO Config reg (common for all pads) */
  __IOM uint32_t LICIO_CIO[27];                 /*!< 0x00000084 LICIO_CIO Config reg (per pad) */
   __IM uint32_t RESERVED1[4];
  __IOM uint32_t GENERAL_LICIO_LI;              /*!< 0x00000100 LICIO_LI Config reg (common for all pads) */
  __IOM uint32_t LICIO_LI[10];                  /*!< 0x00000104 LICIO_LI Config reg (per pad) */
   __IM uint32_t RESERVED2;
  __IOM uint32_t LICIO_VSSIO_IREF;              /*!< 0x00000130 LICIO_VSSIO_IREF Config reg */
   __IM uint32_t LICIO_LI_OUT_STATUS;           /*!< 0x00000134 LICO_LI pad Rx output status */
  __IOM uint32_t PLL_CONFIG;                    /*!< 0x00000138 PLL Configuration register */
  __IOM uint32_t PLL_CONFIG_2;                  /*!< 0x0000013C PLL Configuration register2 */
   __IM uint32_t PLL_STATUS;                    /*!< 0x00000140 PLL Status Register */
  __IOM uint32_t REG_1P25;                      /*!< 0x00000144 REG1P25 Config reg */
  __IOM uint32_t RX[10];                        /*!< 0x00000148 LVDS RX Configuration Registers */
  __IOM uint32_t GENERAL_RX;                    /*!< 0x00000170 General RX Configuration Register */
  __IOM uint32_t GENERAL_RX_LVCMOS;             /*!< 0x00000174 General LVCMOS RX Configuration Register */
  __IOM uint32_t RX_LVCMOS[26];                 /*!< 0x00000178 LVCMOS RX Configuration Registers */
   __IM uint32_t RESERVED3[9];
  __IOM uint32_t PRBS_GEN;                      /*!< 0x00000204 State counter limit register */
  __IOM uint32_t PHY_GENERAL_CONFIG;            /*!< 0x00000208 Phy Configuration register */
   __IM uint32_t PHY_GENERAL_STATUS_1;          /*!< 0x0000020C Phy Status register (Loopback Status Lanes) */
   __IM uint32_t PHY_GENERAL_STATUS_2;          /*!< 0x00000210 Phy Status register */
  __IOM uint32_t PHY_INTR;                      /*!< 0x00000214 Phy Interrupt Register */
  __IOM uint32_t PHY_INTR_MASK;                 /*!< 0x00000218 Phy Interrupt Mask Register */
   __IM uint32_t PHY_INTR_MASKED;               /*!< 0x0000021C Phy Interrupt Masked Register */
  __IOM uint32_t PHY_INTR_SET;                  /*!< 0x00000220 Phy Interrupt Set Register */
  __IOM uint32_t PHY_TRAIN_CONFIG;              /*!< 0x00000224 Phy Training Mode Config register */
  __IOM uint32_t PHY_ADC_CONFIG;                /*!< 0x00000228 ADC config register */
  __IOM uint32_t PHY_DDFT_MUX_SEL;              /*!< 0x0000022C Digital Mux Select Register */
  __IOM uint32_t LICIO_VCCD_V1P1;               /*!< 0x00000230 LICIO_VCCD_V1P1 Config reg */
  __IOM uint32_t PHY_GPIO[26];                  /*!< 0x00000234 GPIO Config register */
   __IM uint32_t RESERVED4[26];
  __IOM uint32_t PHY_GPIO_INTR_CFG;             /*!< 0x00000304 GPIO Interrupt Config register */
   __IM uint32_t RESERVED5;
  __IOM uint32_t PHY_GENERAL_CONFIG_2;          /*!< 0x0000030C Phy Configuration Register2 */
   __IM uint32_t PRBS_STATUS;                   /*!< 0x00000310 Loopback error rate register */
  __IOM uint32_t LVDS_STATUS_MONITOR[10];       /*!< 0x00000314 LVDS Pin status monitor */
   __IM uint32_t RESERVED6;
   __IM uint32_t PHY_ADC_STATUS;                /*!< 0x00000340 ADC status register */
  __IOM uint32_t FRM_CLK_GLITCH_FILTER;         /*!< 0x00000344 Frame clock glitch filter configuration register */
   __IM uint32_t RESERVED7[46];
  __IOM uint32_t LICIO_CIO_CTRL_DS;             /*!< 0x00000400 LICIO_CIO control pad DS/SR register */
  __IOM uint32_t LICIO_CIO_DATA_DS[17];         /*!< 0x00000404 LICIO_CIO Data/Clk pad DS/SR register */
   __IM uint32_t RESERVED8[45];
  __IOM uint32_t DLY_CELL_LOAD;                 /*!< 0x000004FC Delay cell Load control register */
  __IOM uint32_t SAR_CLK_FREQ_CFG;              /*!< 0x00000500 SAR clock frequency configuration */
   __IM uint32_t STUCK_AT_CNTRS;                /*!< 0x00000504 Stuck-at fault counters */
  __IOM uint32_t STUCK_CNTR_RST_CTL;            /*!< 0x00000508 Stuck-at fault counters Reset control register */
   __IM uint32_t RESERVED9;
  __IOM uint32_t STUCK_CNTR_SIG_SEL_0;          /*!< 0x00000510 Stuck at fault counter signal select */
  __IOM uint32_t STUCK_CNTR_SIG_SEL_1;          /*!< 0x00000514 Stuck at fault counter signal select */
   __IM uint32_t RESERVED10[2];
  __IOM uint32_t CTL_PIN_SDLL_CFG[7];           /*!< 0x00000520 Control pin slave dll monitor config */
   __IM uint32_t RESERVED11;
   __IM uint32_t LVDS_BER_STATUS;               /*!< 0x00000540 LVDS rx_data_channel instance ber status */
   __IM uint32_t RESERVED12[175];
} LVDSSS_LVDS_AFE_V1_Type;                      /*!< Size = 2048 (0x800) */

/**
  * \brief Socket Registers (LVDSSS_LVDS_ADAPTER_DMA_SCK)
  */
typedef struct {
  __IOM uint32_t SCK_DSCR;                      /*!< 0x00000000 Descriptor Chain Pointer */
  __IOM uint32_t SCK_SIZE;                      /*!< 0x00000004 Transfer Size Register */
  __IOM uint32_t SCK_COUNT;                     /*!< 0x00000008 Transfer Count Register */
  __IOM uint32_t SCK_STATUS;                    /*!< 0x0000000C Socket Status Register */
  __IOM uint32_t SCK_INTR;                      /*!< 0x00000010 Socket Interrupt Request Register */
  __IOM uint32_t SCK_INTR_MASK;                 /*!< 0x00000014 Socket Interrupt Mask Register */
   __IM uint32_t RESERVED[2];
  __IOM uint32_t DSCR_BUFFER;                   /*!< 0x00000020 Descriptor buffer base address register */
  __IOM uint32_t DSCR_SYNC;                     /*!< 0x00000024 Descriptor synchronization pointers register */
  __IOM uint32_t DSCR_CHAIN;                    /*!< 0x00000028 Descriptor Chain Pointers Register */
  __IOM uint32_t DSCR_SIZE;                     /*!< 0x0000002C Descriptor Size Register */
   __IM uint32_t RESERVED1[19];
   __OM uint32_t EVENT;                         /*!< 0x0000007C Event Communication Register */
} LVDSSS_LVDS_ADAPTER_DMA_SCK_V1_Type;          /*!< Size = 128 (0x80) */

/**
  * \brief General DMA Registers (LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL)
  */
typedef struct {
   __IM uint32_t SCK_INTR;                      /*!< 0x00000000 Socket Interrupt Request Register */
   __IM uint32_t RESERVED[59];
  __IOM uint32_t ADAPTER_CTRL;                  /*!< 0x000000F0 Adapter Control Register */
   __IM uint32_t ADAPTER_DEBUG;                 /*!< 0x000000F4 Adapter Debug Observation Register */
  __IOM uint32_t ADAPTER_CONF;                  /*!< 0x000000F8 Adapter Configuration Register */
   __IM uint32_t ADAPTER_STATUS;                /*!< 0x000000FC Adapter Global Status Fields */
} LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_V1_Type;      /*!< Size = 256 (0x100) */

/**
  * \brief LVDS Adapter Registers
0x1_0000 is for Adapter-0 and 0x2_0000 is for Adapter-1 (LVDSSS_LVDS_ADAPTER_DMA)
  */
typedef struct {
   __IM uint32_t RESERVED[8192];
        LVDSSS_LVDS_ADAPTER_DMA_SCK_V1_Type SCK[16]; /*!< 0x00008000 Socket Registers */
   __IM uint32_t RESERVED1[7616];
        LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_V1_Type SCK_GBL; /*!< 0x0000FF00 General DMA Registers */
} LVDSSS_LVDS_ADAPTER_DMA_V1_Type;              /*!< Size = 65536 (0x10000) */

