RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_lvdsss.h
/**
  * \brief LVDS IP register map (LVDSSS_LVDS)
  */
typedef struct {
  __IOM uint32_t CTL;                           /*!< 0x00000000 IP Control Register */
  __IOM uint32_t LINK_CONFIG[2];                /*!< 0x00000004 Link Configuration Register */
  __IOM uint32_t THREAD_INTLV_CTL;              /*!< 0x0000000C Thread interleave control register */
  __IOM uint32_t LVDS_INTR_WD0;                 /*!< 0x00000010 LVDS Interrupt Request Register */
  __IOM uint32_t LVDS_INTR_WD1;                 /*!< 0x00000014 LVDS Interrupt Request Register */
   __IM uint32_t RESERVED[2];
  __IOM uint32_t LVDS_INTR_MASK_WD0;            /*!< 0x00000020 LVDS Interrupt Mask Register */
  __IOM uint32_t LVDS_INTR_MASK_WD1;            /*!< 0x00000024 LVDS Interrupt Mask Register */
   __IM uint32_t RESERVED1[2];
   __IM uint32_t LVDS_INTR_MASKED_WD0;          /*!< 0x00000030 LVDS Interrupt Generator */
   __IM uint32_t LVDS_INTR_MASKED_WD1;          /*!< 0x00000034 LVDS Interrupt Generator */
   __IM uint32_t RESERVED2[2];
  __IOM uint32_t LVDS_INTR_SET_WD0;             /*!< 0x00000040 LVDS Interrupt Set Register */
  __IOM uint32_t LVDS_INTR_SET_WD1;             /*!< 0x00000044 LVDS Interrupt Set Register */
   __IM uint32_t RESERVED3[2];
   __IM uint32_t LVDS_ERROR;                    /*!< 0x00000050 LVDS Error Indicator Register */
  __IOM uint32_t LVDS_EOP_EOT;                  /*!< 0x00000054 LVDS EOP/EOT configuration */
  __IOM uint32_t LANE_FIFO_STS[2];              /*!< 0x00000058 Lane fifo status Register */
  __IOM uint32_t GPIF_CLK_SEL[2];               /*!< 0x00000060 GPIF Clock selection Register */
   __IM uint32_t RESERVED4;
  __IOM uint32_t USB_FRM_CNTR_CFG;              /*!< 0x0000006C USB frame counter config */
   __IM uint32_t TIME_STAMP_CLK_DW0;            /*!< 0x00000070 Timestamp nanosecond counter */
   __IM uint32_t TIME_STAMP_CLK_DW1;            /*!< 0x00000074 Timestamp nanosecond counter */
   __IM uint32_t RESERVED5[2];
  __IOM uint32_t SCRSS_VALUE_CFG[2];            /*!< 0x00000080 SCRSS value configuration select */
   __IM uint32_t RESERVED6[2];
  __IOM uint32_t TRAINING_BLK_CFG;              /*!< 0x00000090 Training block configuration */
  __IOM uint32_t TRAINING_BLK;                  /*!< 0x00000094 Training block sequence bytes */
  __IOM uint32_t LINK_TRAINING_STS[2];          /*!< 0x00000098 Training block detection status register */
  __IOM uint32_t DDFT_MUX_SEL;                  /*!< 0x000000A0 Debug Mux select */
  __IOM uint32_t GPIO_DDFT_MUX_SEL;             /*!< 0x000000A4 Debug Mux select */
  __IOM uint32_t LOOPBACK_CFG;                  /*!< 0x000000A8 Loopback Configuration register */
   __IM uint32_t RESERVED7;
  __IOM uint32_t LVDS_CHAR_CFG[2];              /*!< 0x000000B0 LVDS lanes characterisation config register */
  __IOM uint32_t CLK_GATE_DIS;                  /*!< 0x000000B8 Thread controller Clock gate disable config register */
  __IOM uint32_t VERSION_SEL;                   /*!< 0x000000BC lvds ip version select */
        LVDSSS_LVDS_LVDS_LOW_PWR_INTR_V1_Type LVDS_LOW_PWR_INTR; /*!< 0x000000C0 LVDS Low power and Wakeup Interrupt registers */
   __IM uint32_t RESERVED8[8];
  __IOM uint32_t TH0_TH1_METADATA_RAM[64];      /*!< 0x00000100 Metadata Memory */
  __IOM uint32_t TH2_TH3_METADATA_RAM[64];      /*!< 0x00000200 Metadata Memory */
   __IM uint32_t RESERVED9[64];
        LVDSSS_LVDS_THREAD_V1_Type THREAD[4];   /*!< 0x00000400 Set of registers for a thread */
   __IM uint32_t RESERVED10[256];
        LVDSSS_LVDS_GPIF_V1_Type GPIF[2];       /*!< 0x00001000 GPIF-II Configuration Registers */
        LVDSSS_LVDS_AFE_V1_Type AFE[2];         /*!< 0x00007000 Phy Configuration Registers */
   __IM uint32_t RESERVED11[8192];
        LVDSSS_LVDS_ADAPTER_DMA_V1_Type ADAPTER_DMA[2]; /*!< 0x00010000 LVDS Adapter Registers 0x1_0000 is for Adapter-0 and 0x2_0000
                                                                is for Adapter-1 */
   __IM uint32_t RESERVED12[16384];
} LVDSSS_LVDS_V1_Type;                          /*!< Size = 262144 (0x40000) */

/**
  * \brief LVDS IP Registers (LVDSSS)
  */
typedef struct {
        LVDSSS_LVDS_V1_Type LVDS;               /*!< 0x00000000 LVDS IP register map */
} LVDSSS_V1_Type;                               /*!< Size = 262144 (0x40000) */


/* LVDSSS_LVDS_LVDS_LOW_PWR_INTR.LVDS_WAKEUP_INTR */
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LVDS_WAKEUP_INTR_LNK0_L3_EXIT_Pos 0UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LVDS_WAKEUP_INTR_LNK0_L3_EXIT_Msk 0x1UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LVDS_WAKEUP_INTR_LNK1_L3_EXIT_Pos 1UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LVDS_WAKEUP_INTR_LNK1_L3_EXIT_Msk 0x2UL
/* LVDSSS_LVDS_LVDS_LOW_PWR_INTR.LVDS_WAKEUP_INTR_MASK */
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LVDS_WAKEUP_INTR_MASK_LNK0_L3_EXIT_Pos 0UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LVDS_WAKEUP_INTR_MASK_LNK0_L3_EXIT_Msk 0x1UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LVDS_WAKEUP_INTR_MASK_LNK1_L3_EXIT_Pos 1UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LVDS_WAKEUP_INTR_MASK_LNK1_L3_EXIT_Msk 0x2UL
/* LVDSSS_LVDS_LVDS_LOW_PWR_INTR.LVDS_WAKEUP_INTR_MASKED */
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LVDS_WAKEUP_INTR_MASKED_LNK0_L3_EXIT_Pos 0UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LVDS_WAKEUP_INTR_MASKED_LNK0_L3_EXIT_Msk 0x1UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LVDS_WAKEUP_INTR_MASKED_LNK1_L3_EXIT_Pos 1UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LVDS_WAKEUP_INTR_MASKED_LNK1_L3_EXIT_Msk 0x2UL
/* LVDSSS_LVDS_LVDS_LOW_PWR_INTR.LVDS_WAKEUP_INTR_SET */
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LVDS_WAKEUP_INTR_SET_LNK0_L3_EXIT_Pos 0UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LVDS_WAKEUP_INTR_SET_LNK0_L3_EXIT_Msk 0x1UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LVDS_WAKEUP_INTR_SET_LNK1_L3_EXIT_Pos 1UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LVDS_WAKEUP_INTR_SET_LNK1_L3_EXIT_Msk 0x2UL
/* LVDSSS_LVDS_LVDS_LOW_PWR_INTR.LOW_PWR_CTL */
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LOW_PWR_CTL_MASK_L1_ENTRY_Pos 0UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LOW_PWR_CTL_MASK_L1_ENTRY_Msk 0x1UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LOW_PWR_CTL_MASK_L3_ENTRY_Pos 1UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LOW_PWR_CTL_MASK_L3_ENTRY_Msk 0x2UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LOW_PWR_CTL_AUTO_MODE_Pos 4UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LOW_PWR_CTL_AUTO_MODE_Msk 0x10UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LOW_PWR_CTL_SEL_ON_OFF_Pos 5UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LOW_PWR_CTL_SEL_ON_OFF_Msk 0x20UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LOW_PWR_CTL_IO_OFF_VALUE_Pos 6UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LOW_PWR_CTL_IO_OFF_VALUE_Msk 0x40UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LOW_PWR_CTL_IO_ON_VALUE_Pos 7UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LOW_PWR_CTL_IO_ON_VALUE_Msk 0x80UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LOW_PWR_CTL_L3_GPIO_CTL_Pos 8UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LOW_PWR_CTL_L3_GPIO_CTL_Msk 0x100UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LOW_PWR_CTL_L3_TO_IO_OFF_DLY_Pos 16UL
#define LVDSSS_LVDS_LVDS_LOW_PWR_INTR_LOW_PWR_CTL_L3_TO_IO_OFF_DLY_Msk 0x7F0000UL


