RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_lvdsss.h
/* LVDSSS_LVDS_THREAD.GPIF_DATA_CTRL */
#define LVDSSS_LVDS_THREAD_GPIF_DATA_CTRL_ING_DATA_VALID_Pos 0UL
#define LVDSSS_LVDS_THREAD_GPIF_DATA_CTRL_ING_DATA_VALID_Msk 0x1UL
#define LVDSSS_LVDS_THREAD_GPIF_DATA_CTRL_EG_DATA_VALID_Pos 1UL
#define LVDSSS_LVDS_THREAD_GPIF_DATA_CTRL_EG_DATA_VALID_Msk 0x2UL
#define LVDSSS_LVDS_THREAD_GPIF_DATA_CTRL_IN_ADDR_VALID_Pos 2UL
#define LVDSSS_LVDS_THREAD_GPIF_DATA_CTRL_IN_ADDR_VALID_Msk 0x4UL
#define LVDSSS_LVDS_THREAD_GPIF_DATA_CTRL_EG_ADDR_VALID_Pos 3UL
#define LVDSSS_LVDS_THREAD_GPIF_DATA_CTRL_EG_ADDR_VALID_Msk 0x8UL
/* LVDSSS_LVDS_THREAD.GPIF_INGRESS_DATA_WORD0 */
#define LVDSSS_LVDS_THREAD_GPIF_INGRESS_DATA_WORD0_DATA_Pos 0UL
#define LVDSSS_LVDS_THREAD_GPIF_INGRESS_DATA_WORD0_DATA_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_THREAD.GPIF_INGRESS_DATA_WORD1 */
#define LVDSSS_LVDS_THREAD_GPIF_INGRESS_DATA_WORD1_DATA_Pos 0UL
#define LVDSSS_LVDS_THREAD_GPIF_INGRESS_DATA_WORD1_DATA_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_THREAD.GPIF_INGRESS_DATA_WORD2 */
#define LVDSSS_LVDS_THREAD_GPIF_INGRESS_DATA_WORD2_DATA_Pos 0UL
#define LVDSSS_LVDS_THREAD_GPIF_INGRESS_DATA_WORD2_DATA_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_THREAD.GPIF_INGRESS_DATA_WORD3 */
#define LVDSSS_LVDS_THREAD_GPIF_INGRESS_DATA_WORD3_DATA_Pos 0UL
#define LVDSSS_LVDS_THREAD_GPIF_INGRESS_DATA_WORD3_DATA_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_THREAD.GPIF_EGRESS_DATA_WORD0 */
#define LVDSSS_LVDS_THREAD_GPIF_EGRESS_DATA_WORD0_DATA_Pos 0UL
#define LVDSSS_LVDS_THREAD_GPIF_EGRESS_DATA_WORD0_DATA_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_THREAD.GPIF_EGRESS_DATA_WORD1 */
#define LVDSSS_LVDS_THREAD_GPIF_EGRESS_DATA_WORD1_DATA_Pos 0UL
#define LVDSSS_LVDS_THREAD_GPIF_EGRESS_DATA_WORD1_DATA_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_THREAD.GPIF_INGRESS_ADDRESS */
#define LVDSSS_LVDS_THREAD_GPIF_INGRESS_ADDRESS_ADDRESS_Pos 0UL
#define LVDSSS_LVDS_THREAD_GPIF_INGRESS_ADDRESS_ADDRESS_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_THREAD.GPIF_EGRESS_ADDRESS */
#define LVDSSS_LVDS_THREAD_GPIF_EGRESS_ADDRESS_ADDRESS_Pos 0UL
#define LVDSSS_LVDS_THREAD_GPIF_EGRESS_ADDRESS_ADDRESS_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_THREAD.GPIF_THREAD_CONFIG */
#define LVDSSS_LVDS_THREAD_GPIF_THREAD_CONFIG_THREAD_NUM_Pos 0UL
#define LVDSSS_LVDS_THREAD_GPIF_THREAD_CONFIG_THREAD_NUM_Msk 0x1UL
#define LVDSSS_LVDS_THREAD_GPIF_THREAD_CONFIG_THREAD_SOCK_Pos 1UL
#define LVDSSS_LVDS_THREAD_GPIF_THREAD_CONFIG_THREAD_SOCK_Msk 0xEUL
#define LVDSSS_LVDS_THREAD_GPIF_THREAD_CONFIG_ADAPTOR_NUM_Pos 4UL
#define LVDSSS_LVDS_THREAD_GPIF_THREAD_CONFIG_ADAPTOR_NUM_Msk 0x10UL
#define LVDSSS_LVDS_THREAD_GPIF_THREAD_CONFIG_WM_CFG_Pos 7UL
#define LVDSSS_LVDS_THREAD_GPIF_THREAD_CONFIG_WM_CFG_Msk 0x80UL
#define LVDSSS_LVDS_THREAD_GPIF_THREAD_CONFIG_BURST_SIZE_Pos 8UL
#define LVDSSS_LVDS_THREAD_GPIF_THREAD_CONFIG_BURST_SIZE_Msk 0xF00UL
#define LVDSSS_LVDS_THREAD_GPIF_THREAD_CONFIG_WATERMARK_Pos 16UL
#define LVDSSS_LVDS_THREAD_GPIF_THREAD_CONFIG_WATERMARK_Msk 0x3FFF0000UL
#define LVDSSS_LVDS_THREAD_GPIF_THREAD_CONFIG_ENABLE_THREAD_CTLR_Pos 31UL
#define LVDSSS_LVDS_THREAD_GPIF_THREAD_CONFIG_ENABLE_THREAD_CTLR_Msk 0x80000000UL
/* LVDSSS_LVDS_THREAD.VARW0 */
#define LVDSSS_LVDS_THREAD_VARW0_VARW0_Pos      0UL
#define LVDSSS_LVDS_THREAD_VARW0_VARW0_Msk      0xFFFFUL
/* LVDSSS_LVDS_THREAD.VARW1 */
#define LVDSSS_LVDS_THREAD_VARW1_VARW1_Pos      0UL
#define LVDSSS_LVDS_THREAD_VARW1_VARW1_Msk      0xFFFFUL
/* LVDSSS_LVDS_THREAD.PTSSS */
#define LVDSSS_LVDS_THREAD_PTSSS_PTSSS_WD0_Pos  0UL
#define LVDSSS_LVDS_THREAD_PTSSS_PTSSS_WD0_Msk  0xFFFFUL
#define LVDSSS_LVDS_THREAD_PTSSS_PTSSS_WD1_Pos  16UL
#define LVDSSS_LVDS_THREAD_PTSSS_PTSSS_WD1_Msk  0xFFFF0000UL
/* LVDSSS_LVDS_THREAD.SCRSS_DW0 */
#define LVDSSS_LVDS_THREAD_SCRSS_DW0_SCRSS_WD0_Pos 0UL
#define LVDSSS_LVDS_THREAD_SCRSS_DW0_SCRSS_WD0_Msk 0xFFFFUL
#define LVDSSS_LVDS_THREAD_SCRSS_DW0_SCRSS_WD1_Pos 16UL
#define LVDSSS_LVDS_THREAD_SCRSS_DW0_SCRSS_WD1_Msk 0xFFFF0000UL
/* LVDSSS_LVDS_THREAD.SCRSS_DW1 */
#define LVDSSS_LVDS_THREAD_SCRSS_DW1_SCRSS_WD2_Pos 0UL
#define LVDSSS_LVDS_THREAD_SCRSS_DW1_SCRSS_WD2_Msk 0xFFFFUL
/* LVDSSS_LVDS_THREAD.HDR_FLGS */
#define LVDSSS_LVDS_THREAD_HDR_FLGS_FLG_Pos     0UL
#define LVDSSS_LVDS_THREAD_HDR_FLGS_FLG_Msk     0xFUL
/* LVDSSS_LVDS_THREAD.EVC_VAR0_DW0 */
#define LVDSSS_LVDS_THREAD_EVC_VAR0_DW0_EVC_V0_WD0_Pos 0UL
#define LVDSSS_LVDS_THREAD_EVC_VAR0_DW0_EVC_V0_WD0_Msk 0xFFFFUL
#define LVDSSS_LVDS_THREAD_EVC_VAR0_DW0_EVC_V0_WD1_Pos 16UL
#define LVDSSS_LVDS_THREAD_EVC_VAR0_DW0_EVC_V0_WD1_Msk 0xFFFF0000UL
/* LVDSSS_LVDS_THREAD.EVC_VAR0_DW1 */
#define LVDSSS_LVDS_THREAD_EVC_VAR0_DW1_EVC_V0_WD2_Pos 0UL
#define LVDSSS_LVDS_THREAD_EVC_VAR0_DW1_EVC_V0_WD2_Msk 0xFFFFUL
#define LVDSSS_LVDS_THREAD_EVC_VAR0_DW1_EVC_V0_WD3_Pos 16UL
#define LVDSSS_LVDS_THREAD_EVC_VAR0_DW1_EVC_V0_WD3_Msk 0xFFFF0000UL
/* LVDSSS_LVDS_THREAD.EVC_VAR1_DW0 */
#define LVDSSS_LVDS_THREAD_EVC_VAR1_DW0_EVC_V1_WD0_Pos 0UL
#define LVDSSS_LVDS_THREAD_EVC_VAR1_DW0_EVC_V1_WD0_Msk 0xFFFFUL
#define LVDSSS_LVDS_THREAD_EVC_VAR1_DW0_EVC_V1_WD1_Pos 16UL
#define LVDSSS_LVDS_THREAD_EVC_VAR1_DW0_EVC_V1_WD1_Msk 0xFFFF0000UL
/* LVDSSS_LVDS_THREAD.EVC_VAR1_DW1 */
#define LVDSSS_LVDS_THREAD_EVC_VAR1_DW1_EVC_V1_WD2_Pos 0UL
#define LVDSSS_LVDS_THREAD_EVC_VAR1_DW1_EVC_V1_WD2_Msk 0xFFFFUL
#define LVDSSS_LVDS_THREAD_EVC_VAR1_DW1_EVC_V1_WD3_Pos 16UL
#define LVDSSS_LVDS_THREAD_EVC_VAR1_DW1_EVC_V1_WD3_Msk 0xFFFF0000UL
/* LVDSSS_LVDS_THREAD.PLC_DW0 */
#define LVDSSS_LVDS_THREAD_PLC_DW0_PLC_WD0_Pos  0UL
#define LVDSSS_LVDS_THREAD_PLC_DW0_PLC_WD0_Msk  0xFFFFUL
#define LVDSSS_LVDS_THREAD_PLC_DW0_PLC_WD1_Pos  16UL
#define LVDSSS_LVDS_THREAD_PLC_DW0_PLC_WD1_Msk  0xFFFF0000UL
/* LVDSSS_LVDS_THREAD.PLC_DW1 */
#define LVDSSS_LVDS_THREAD_PLC_DW1_PLC_WD2_Pos  0UL
#define LVDSSS_LVDS_THREAD_PLC_DW1_PLC_WD2_Msk  0xFFFFUL
#define LVDSSS_LVDS_THREAD_PLC_DW1_PLC_WD3_Pos  16UL
#define LVDSSS_LVDS_THREAD_PLC_DW1_PLC_WD3_Msk  0xFFFF0000UL
/* LVDSSS_LVDS_THREAD.PAYLOAD_CFG */
#define LVDSSS_LVDS_THREAD_PAYLOAD_CFG_CNT_MDATA_AS_PAYLOAD_Pos 0UL
#define LVDSSS_LVDS_THREAD_PAYLOAD_CFG_CNT_MDATA_AS_PAYLOAD_Msk 0x1UL
#define LVDSSS_LVDS_THREAD_PAYLOAD_CFG_CNT_CRC_AS_PAYLOAD_Pos 1UL
#define LVDSSS_LVDS_THREAD_PAYLOAD_CFG_CNT_CRC_AS_PAYLOAD_Msk 0x2UL
/* LVDSSS_LVDS_THREAD.DCRC_CONFIG */
#define LVDSSS_LVDS_THREAD_DCRC_CONFIG_BIT_ENDIAN_Pos 0UL
#define LVDSSS_LVDS_THREAD_DCRC_CONFIG_BIT_ENDIAN_Msk 0x1UL
#define LVDSSS_LVDS_THREAD_DCRC_CONFIG_BYTE_ENDIAN_Pos 1UL
#define LVDSSS_LVDS_THREAD_DCRC_CONFIG_BYTE_ENDIAN_Msk 0x2UL
#define LVDSSS_LVDS_THREAD_DCRC_CONFIG_CRC_ENABLE_Pos 2UL
#define LVDSSS_LVDS_THREAD_DCRC_CONFIG_CRC_ENABLE_Msk 0x4UL
#define LVDSSS_LVDS_THREAD_DCRC_CONFIG_CRC_VAL_BIT_ENDIAN_Pos 4UL
#define LVDSSS_LVDS_THREAD_DCRC_CONFIG_CRC_VAL_BIT_ENDIAN_Msk 0x10UL
#define LVDSSS_LVDS_THREAD_DCRC_CONFIG_CRC_VAL_BYTE_ENDIAN_Pos 5UL
#define LVDSSS_LVDS_THREAD_DCRC_CONFIG_CRC_VAL_BYTE_ENDIAN_Msk 0x20UL
/* LVDSSS_LVDS_THREAD.DCRC */
#define LVDSSS_LVDS_THREAD_DCRC_INITIAL_VALUE_Pos 0UL
#define LVDSSS_LVDS_THREAD_DCRC_INITIAL_VALUE_Msk 0xFFFFUL
#define LVDSSS_LVDS_THREAD_DCRC_CRC_VALUE_Pos   16UL
#define LVDSSS_LVDS_THREAD_DCRC_CRC_VALUE_Msk   0xFFFF0000UL
/* LVDSSS_LVDS_THREAD.DCRC_STS */
#define LVDSSS_LVDS_THREAD_DCRC_STS_CRC_RECEIVED_Pos 0UL
#define LVDSSS_LVDS_THREAD_DCRC_STS_CRC_RECEIVED_Msk 0xFFFFUL
#define LVDSSS_LVDS_THREAD_DCRC_STS_CRC_ERR_CNT_Pos 16UL
#define LVDSSS_LVDS_THREAD_DCRC_STS_CRC_ERR_CNT_Msk 0xFF0000UL
#define LVDSSS_LVDS_THREAD_DCRC_STS_CRC_ERROR_Pos 31UL
#define LVDSSS_LVDS_THREAD_DCRC_STS_CRC_ERROR_Msk 0x80000000UL
/* LVDSSS_LVDS_THREAD.MCRC_CONFIG */
#define LVDSSS_LVDS_THREAD_MCRC_CONFIG_MCRC_BIT_ENDIAN_Pos 0UL
#define LVDSSS_LVDS_THREAD_MCRC_CONFIG_MCRC_BIT_ENDIAN_Msk 0x1UL
#define LVDSSS_LVDS_THREAD_MCRC_CONFIG_MCRC_BYTE_ENDIAN_Pos 1UL
#define LVDSSS_LVDS_THREAD_MCRC_CONFIG_MCRC_BYTE_ENDIAN_Msk 0x2UL
#define LVDSSS_LVDS_THREAD_MCRC_CONFIG_MCRC_ENABLE_Pos 2UL
#define LVDSSS_LVDS_THREAD_MCRC_CONFIG_MCRC_ENABLE_Msk 0x4UL
/* LVDSSS_LVDS_THREAD.MCRC */
#define LVDSSS_LVDS_THREAD_MCRC_INITIAL_VALUE_Pos 0UL
#define LVDSSS_LVDS_THREAD_MCRC_INITIAL_VALUE_Msk 0xFFFFUL
#define LVDSSS_LVDS_THREAD_MCRC_CRC_VALUE_Pos   16UL
#define LVDSSS_LVDS_THREAD_MCRC_CRC_VALUE_Msk   0xFFFF0000UL
/* LVDSSS_LVDS_THREAD.THREAD_DMA_INTF_CFG */
#define LVDSSS_LVDS_THREAD_THREAD_DMA_INTF_CFG_RQ_EMPTY_DLY_Pos 0UL
#define LVDSSS_LVDS_THREAD_THREAD_DMA_INTF_CFG_RQ_EMPTY_DLY_Msk 0x7UL
/* LVDSSS_LVDS_THREAD.MD0_CTRL */
#define LVDSSS_LVDS_THREAD_MD0_CTRL_MD_REF_CTL_Pos 0UL
#define LVDSSS_LVDS_THREAD_MD0_CTRL_MD_REF_CTL_Msk 0x7FFFFFFUL
#define LVDSSS_LVDS_THREAD_MD0_CTRL_MD_SIZE_Pos 27UL
#define LVDSSS_LVDS_THREAD_MD0_CTRL_MD_SIZE_Msk 0xF8000000UL
/* LVDSSS_LVDS_THREAD.MD1_CTRL */
#define LVDSSS_LVDS_THREAD_MD1_CTRL_MD_REF_CTL_Pos 0UL
#define LVDSSS_LVDS_THREAD_MD1_CTRL_MD_REF_CTL_Msk 0x7FFFFFFUL
#define LVDSSS_LVDS_THREAD_MD1_CTRL_MD_SIZE_Pos 27UL
#define LVDSSS_LVDS_THREAD_MD1_CTRL_MD_SIZE_Msk 0xF8000000UL
/* LVDSSS_LVDS_THREAD.MD2_CTRL */
#define LVDSSS_LVDS_THREAD_MD2_CTRL_MD_REF_CTL_Pos 0UL
#define LVDSSS_LVDS_THREAD_MD2_CTRL_MD_REF_CTL_Msk 0x7FFFFFFUL
#define LVDSSS_LVDS_THREAD_MD2_CTRL_MD_SIZE_Pos 27UL
#define LVDSSS_LVDS_THREAD_MD2_CTRL_MD_SIZE_Msk 0xF8000000UL
/* LVDSSS_LVDS_THREAD.MD3_CTRL */
#define LVDSSS_LVDS_THREAD_MD3_CTRL_MD_REF_CTL_Pos 0UL
#define LVDSSS_LVDS_THREAD_MD3_CTRL_MD_REF_CTL_Msk 0x7FFFFFFUL
#define LVDSSS_LVDS_THREAD_MD3_CTRL_MD_SIZE_Pos 27UL
#define LVDSSS_LVDS_THREAD_MD3_CTRL_MD_SIZE_Msk 0xF8000000UL


/* LVDSSS_LVDS_GPIF_LEFT_WAVEFORM.WAVEFORM0 */
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM0_NEXT_STATE_Pos 0UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM0_NEXT_STATE_Msk 0xFFUL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM0_FA_Pos 8UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM0_FA_Msk 0x1F00UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM0_FB_Pos 13UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM0_FB_Msk 0x3E000UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM0_FC_Pos 18UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM0_FC_Msk 0x7C0000UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM0_FD_Pos 23UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM0_FD_Msk 0xF800000UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM0_F0_L_Pos 28UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM0_F0_L_Msk 0xF0000000UL
/* LVDSSS_LVDS_GPIF_LEFT_WAVEFORM.WAVEFORM1 */
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM1_F0_U_Pos 0UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM1_F0_U_Msk 0x1UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM1_F1_Pos 1UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM1_F1_Msk 0x3EUL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM1_ALPHA_LEFT_Pos 6UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM1_ALPHA_LEFT_Msk 0x3FC0UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM1_ALPHA_RIGHT_Pos 14UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM1_ALPHA_RIGHT_Msk 0x3FC000UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM1_BETA_L_Pos 22UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM1_BETA_L_Msk 0xFFC00000UL
/* LVDSSS_LVDS_GPIF_LEFT_WAVEFORM.WAVEFORM2 */
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM2_BETA_U_Pos 0UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM2_BETA_U_Msk 0x3FFFFFUL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM2_REPEAT_COUNT_Pos 22UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM2_REPEAT_COUNT_Msk 0x3FC00000UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM2_BETA_DEASSERT_Pos 30UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM2_BETA_DEASSERT_Msk 0x40000000UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM2_VALID_Pos 31UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM2_VALID_Msk 0x80000000UL
/* LVDSSS_LVDS_GPIF_LEFT_WAVEFORM.WAVEFORM3 */
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM3_FA_5_Pos 0UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM3_FA_5_Msk 0x1UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM3_FB_5_Pos 1UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM3_FB_5_Msk 0x2UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM3_FC_5_Pos 2UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM3_FC_5_Msk 0x4UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM3_FD_5_Pos 3UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM3_FD_5_Msk 0x8UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM3_RESERVED_Pos 4UL
#define LVDSSS_LVDS_GPIF_LEFT_WAVEFORM_WAVEFORM3_RESERVED_Msk 0xFFFFFFF0UL


/* LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM.WAVEFORM0 */
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM0_NEXT_STATE_Pos 0UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM0_NEXT_STATE_Msk 0xFFUL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM0_FA_Pos 8UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM0_FA_Msk 0x1F00UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM0_FB_Pos 13UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM0_FB_Msk 0x3E000UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM0_FC_Pos 18UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM0_FC_Msk 0x7C0000UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM0_FD_Pos 23UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM0_FD_Msk 0xF800000UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM0_F0_L_Pos 28UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM0_F0_L_Msk 0xF0000000UL
/* LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM.WAVEFORM1 */
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM1_F0_U_Pos 0UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM1_F0_U_Msk 0x1UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM1_F1_Pos 1UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM1_F1_Msk 0x3EUL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM1_ALPHA_LEFT_Pos 6UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM1_ALPHA_LEFT_Msk 0x3FC0UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM1_ALPHA_RIGHT_Pos 14UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM1_ALPHA_RIGHT_Msk 0x3FC000UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM1_BETA_L_Pos 22UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM1_BETA_L_Msk 0xFFC00000UL
/* LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM.WAVEFORM2 */
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM2_BETA_U_Pos 0UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM2_BETA_U_Msk 0x3FFFFFUL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM2_REPEAT_COUNT_Pos 22UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM2_REPEAT_COUNT_Msk 0x3FC00000UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM2_BETA_DEASSERT_Pos 30UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM2_BETA_DEASSERT_Msk 0x40000000UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM2_VALID_Pos 31UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM2_VALID_Msk 0x80000000UL
/* LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM.WAVEFORM3 */
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM3_FA_5_Pos 0UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM3_FA_5_Msk 0x1UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM3_FB_5_Pos 1UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM3_FB_5_Msk 0x2UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM3_FC_5_Pos 2UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM3_FC_5_Msk 0x4UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM3_FD_5_Pos 3UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM3_FD_5_Msk 0x8UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM3_RESERVED_Pos 4UL
#define LVDSSS_LVDS_GPIF_RIGHT_WAVEFORM_WAVEFORM3_RESERVED_Msk 0xFFFFFFF0UL


