RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_lvdsss.h
/* LVDSSS_LVDS_GPIF.GPIF_CONFIG */
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_CTRL_COMP_ENABLE_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_CTRL_COMP_ENABLE_Msk 0x1UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_ADDR_COMP_ENABLE_Pos 1UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_ADDR_COMP_ENABLE_Msk 0x2UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_DATA_COMP_ENABLE_Pos 2UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_DATA_COMP_ENABLE_Msk 0x4UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_CLK_SOURCE_Pos 4UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_CLK_SOURCE_Msk 0x10UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_SPARE0_Pos 5UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_SPARE0_Msk 0x20UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_EN_CLK_IN_Pos 6UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_EN_CLK_IN_Msk 0x40UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_DOUT_POP_EN_Pos 7UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_DOUT_POP_EN_Msk 0x80UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_ENDIAN_Pos 10UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_ENDIAN_Msk 0x400UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_ADDR_COMP_TOGGLE_Pos 11UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_ADDR_COMP_TOGGLE_Msk 0x800UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_CTRL_COMP_TOGGLE_Pos 12UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_CTRL_COMP_TOGGLE_Msk 0x1000UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_DATA_COMP_TOGGLE_Pos 13UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_DATA_COMP_TOGGLE_Msk 0x2000UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_THREAD_IN_STATE_Pos 15UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_THREAD_IN_STATE_Msk 0x8000UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_THREAD_IN_CTL_BYT_Pos 16UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_THREAD_IN_CTL_BYT_Msk 0x10000UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_SOCKET_IN_CTL_BYT_Pos 17UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_SOCKET_IN_CTL_BYT_Msk 0x20000UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_EOP_4M_FSM_Pos 18UL
#define LVDSSS_LVDS_GPIF_GPIF_CONFIG_EOP_4M_FSM_Msk 0x40000UL
/* LVDSSS_LVDS_GPIF.GPIF_BUS_CONFIG */
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_TH0_PTS_TRIG_PRESENT_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_TH0_PTS_TRIG_PRESENT_Msk 0x1UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_TH1_PTS_TRIG_PRESENT_Pos 1UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_TH1_PTS_TRIG_PRESENT_Msk 0x2UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_TH2_PTS_TRIG_PRESENT_Pos 2UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_TH2_PTS_TRIG_PRESENT_Msk 0x4UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_TH3_PTS_TRIG_PRESENT_Pos 3UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_TH3_PTS_TRIG_PRESENT_Msk 0x8UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_ADR_CTRL_Pos 4UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_ADR_CTRL_Msk 0x1F0UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_CE_PRESENT_Pos 9UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_CE_PRESENT_Msk 0x200UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_WE_PRESENT_Pos 10UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_WE_PRESENT_Msk 0x400UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_EM_VLD_PRESENT_Pos 11UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_EM_VLD_PRESENT_Msk 0x800UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_OE_PRESENT_Pos 12UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_OE_PRESENT_Msk 0x1000UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_EM_VLD_MASK_CS_WR_Pos 13UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_EM_VLD_MASK_CS_WR_Msk 0x2000UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_FIO0_PRESENT_Pos 14UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_FIO0_PRESENT_Msk 0x4000UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_FIO1_PRESENT_Pos 15UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_FIO1_PRESENT_Msk 0x8000UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_CNTR_PRESENT_Pos 16UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_CNTR_PRESENT_Msk 0x10000UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_SPARE2_Pos 18UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_SPARE2_Msk 0xC0000UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_SPARE3_Pos 20UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_SPARE3_Msk 0x100000UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_FIO0_CONF_Pos 24UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_FIO0_CONF_Msk 0xF000000UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_FIO1_CONF_Pos 28UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG_FIO1_CONF_Msk 0xF0000000UL
/* LVDSSS_LVDS_GPIF.GPIF_BUS_CONFIG2 */
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG2_STATE_FROM_CTRL_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG2_STATE_FROM_CTRL_Msk 0x7UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG2_STATE5_Pos 8UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG2_STATE5_Msk 0x3F00UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG2_STATE6_Pos 16UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG2_STATE6_Msk 0x3F0000UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG2_STATE7_Pos 24UL
#define LVDSSS_LVDS_GPIF_GPIF_BUS_CONFIG2_STATE7_Msk 0x3F000000UL
/* LVDSSS_LVDS_GPIF.GPIF_AD_CONFIG */
#define LVDSSS_LVDS_GPIF_GPIF_AD_CONFIG_DQ_OEN_CFG_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_AD_CONFIG_DQ_OEN_CFG_Msk 0x3UL
#define LVDSSS_LVDS_GPIF_GPIF_AD_CONFIG_A_OEN_CFG_Pos 2UL
#define LVDSSS_LVDS_GPIF_GPIF_AD_CONFIG_A_OEN_CFG_Msk 0xCUL
#define LVDSSS_LVDS_GPIF_GPIF_AD_CONFIG_AIN_SELECT_Pos 4UL
#define LVDSSS_LVDS_GPIF_GPIF_AD_CONFIG_AIN_SELECT_Msk 0x30UL
#define LVDSSS_LVDS_GPIF_GPIF_AD_CONFIG_AOUT_SELECT_Pos 6UL
#define LVDSSS_LVDS_GPIF_GPIF_AD_CONFIG_AOUT_SELECT_Msk 0xC0UL
#define LVDSSS_LVDS_GPIF_GPIF_AD_CONFIG_DOUT_SELECT_Pos 8UL
#define LVDSSS_LVDS_GPIF_GPIF_AD_CONFIG_DOUT_SELECT_Msk 0x100UL
#define LVDSSS_LVDS_GPIF_GPIF_AD_CONFIG_AIN_DATA_Pos 9UL
#define LVDSSS_LVDS_GPIF_GPIF_AD_CONFIG_AIN_DATA_Msk 0x200UL
#define LVDSSS_LVDS_GPIF_GPIF_AD_CONFIG_ADDRESS_THREAD_Pos 16UL
#define LVDSSS_LVDS_GPIF_GPIF_AD_CONFIG_ADDRESS_THREAD_Msk 0x30000UL
#define LVDSSS_LVDS_GPIF_GPIF_AD_CONFIG_DATA_THREAD_Pos 18UL
#define LVDSSS_LVDS_GPIF_GPIF_AD_CONFIG_DATA_THREAD_Msk 0xC0000UL
#define LVDSSS_LVDS_GPIF_GPIF_AD_CONFIG_DQ_INP_EN_CFG_Pos 20UL
#define LVDSSS_LVDS_GPIF_GPIF_AD_CONFIG_DQ_INP_EN_CFG_Msk 0x300000UL
#define LVDSSS_LVDS_GPIF_GPIF_AD_CONFIG_A_INP_EN_CFG_Pos 22UL
#define LVDSSS_LVDS_GPIF_GPIF_AD_CONFIG_A_INP_EN_CFG_Msk 0xC00000UL
/* LVDSSS_LVDS_GPIF.GPIF_CTL_FUNC0 */
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC0_CE_CTL_SEL_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC0_CE_CTL_SEL_Msk 0x1FUL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC0_WE_CTL_SEL_Pos 8UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC0_WE_CTL_SEL_Msk 0x1F00UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC0_OE_CTL_SEL_Pos 16UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC0_OE_CTL_SEL_Msk 0x1F0000UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC0_L3_ENTRY_SEL_Pos 24UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC0_L3_ENTRY_SEL_Msk 0x1F000000UL
/* LVDSSS_LVDS_GPIF.GPIF_CTL_FUNC1 */
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC1_PKTEND_SEL_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC1_PKTEND_SEL_Msk 0x1FUL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC1_EM_VLD_CTL_SEL_Pos 8UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC1_EM_VLD_CTL_SEL_Msk 0x1F00UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC1_TH0_PTS_TRIG_CTL_SEL_Pos 16UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC1_TH0_PTS_TRIG_CTL_SEL_Msk 0x1F0000UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC1_TH1_PTS_TRIG_CTL_SEL_Pos 24UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC1_TH1_PTS_TRIG_CTL_SEL_Msk 0x1F000000UL
/* LVDSSS_LVDS_GPIF.GPIF_CTL_FUNC2 */
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC2_TH2_PTS_TRIG_CTL_SEL_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC2_TH2_PTS_TRIG_CTL_SEL_Msk 0x1FUL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC2_TH3_PTS_TRIG_CTL_SEL_Pos 8UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC2_TH3_PTS_TRIG_CTL_SEL_Msk 0x1F00UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC2_CTL_2_LAMBDA10_SEL_Pos 16UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC2_CTL_2_LAMBDA10_SEL_Msk 0x1F0000UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC2_CTL_2_LAMBDA11_SEL_Pos 24UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC2_CTL_2_LAMBDA11_SEL_Msk 0x1F000000UL
/* LVDSSS_LVDS_GPIF.GPIF_CTL_FUNC3 */
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC3_CTL_2_LAMBDA12_SEL_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC3_CTL_2_LAMBDA12_SEL_Msk 0x1FUL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC3_CTL_2_LAMBDA13_SEL_Pos 8UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC3_CTL_2_LAMBDA13_SEL_Msk 0x1F00UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC3_CTL_2_LAMBDA14_SEL_Pos 16UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC3_CTL_2_LAMBDA14_SEL_Msk 0x1F0000UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC3_CTL_2_LAMBDA15_SEL_Pos 24UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC3_CTL_2_LAMBDA15_SEL_Msk 0x1F000000UL
/* LVDSSS_LVDS_GPIF.GPIF_CTL_FUNC4 */
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC4_CTL_2_LAMBDA16_SEL_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC4_CTL_2_LAMBDA16_SEL_Msk 0x1FUL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC4_CTL_2_LAMBDA17_SEL_Pos 8UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC4_CTL_2_LAMBDA17_SEL_Msk 0x1F00UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC4_CTL_2_LAMBDA18_SEL_Pos 16UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC4_CTL_2_LAMBDA18_SEL_Msk 0x1F0000UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC4_CTL_2_LAMBDA19_SEL_Pos 24UL
#define LVDSSS_LVDS_GPIF_GPIF_CTL_FUNC4_CTL_2_LAMBDA19_SEL_Msk 0x1F000000UL
/* LVDSSS_LVDS_GPIF.GPIF_STATUS */
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_GPIF_DONE_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_GPIF_DONE_Msk 0x1UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_GPIF_FSM_INTR_Pos 1UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_GPIF_FSM_INTR_Msk 0x2UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_SWITCH_TIMEOUT_Pos 2UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_SWITCH_TIMEOUT_Msk 0x4UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_CRC_ERROR_Pos 3UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_CRC_ERROR_Msk 0x8UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_ADDR_COUNT_HIT_Pos 4UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_ADDR_COUNT_HIT_Msk 0x10UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_DATA_COUNT_HIT_Pos 5UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_DATA_COUNT_HIT_Msk 0x20UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_CTRL_COUNT_HIT_Pos 6UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_CTRL_COUNT_HIT_Msk 0x40UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_ADDR_COMP_HIT_Pos 7UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_ADDR_COMP_HIT_Msk 0x80UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_DATA_COMP_HIT_Pos 8UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_DATA_COMP_HIT_Msk 0x100UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_CTRL_COMP_HIT_Pos 9UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_CTRL_COMP_HIT_Msk 0x200UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_WAVEFORM_BUSY_Pos 10UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_WAVEFORM_BUSY_Msk 0x400UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_EG_DATA_EMPTY_Pos 16UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_EG_DATA_EMPTY_Msk 0xF0000UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_IN_DATA_VALID_Pos 20UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_IN_DATA_VALID_Msk 0xF00000UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_INTERRUPT_STATE_Pos 24UL
#define LVDSSS_LVDS_GPIF_GPIF_STATUS_INTERRUPT_STATE_Msk 0xFF000000UL
/* LVDSSS_LVDS_GPIF.GPIF_INTR */
#define LVDSSS_LVDS_GPIF_GPIF_INTR_GPIF_DONE_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_GPIF_DONE_Msk 0x1UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_GPIF_FSM_INTR_Pos 1UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_GPIF_FSM_INTR_Msk 0x2UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SWITCH_TIMEOUT_Pos 2UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SWITCH_TIMEOUT_Msk 0x4UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_CRC_ERROR_Pos 3UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_CRC_ERROR_Msk 0x8UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_ADDR_COUNT_HIT_Pos 4UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_ADDR_COUNT_HIT_Msk 0x10UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_DATA_COUNT_HIT_Pos 5UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_DATA_COUNT_HIT_Msk 0x20UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_CTRL_COUNT_HIT_Pos 6UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_CTRL_COUNT_HIT_Msk 0x40UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_ADDR_COMP_HIT_Pos 7UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_ADDR_COMP_HIT_Msk 0x80UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_DATA_COMP_HIT_Pos 8UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_DATA_COMP_HIT_Msk 0x100UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_CTRL_COMP_HIT_Pos 9UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_CTRL_COMP_HIT_Msk 0x200UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_WAVEFORM_BUSY_Pos 10UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_WAVEFORM_BUSY_Msk 0x400UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_EG_DATA_EMPTY_BIT0_Pos 16UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_EG_DATA_EMPTY_BIT0_Msk 0x10000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_EG_DATA_EMPTY_BIT1_Pos 17UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_EG_DATA_EMPTY_BIT1_Msk 0x20000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_EG_DATA_EMPTY_BIT2_Pos 18UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_EG_DATA_EMPTY_BIT2_Msk 0x40000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_EG_DATA_EMPTY_BIT3_Pos 19UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_EG_DATA_EMPTY_BIT3_Msk 0x80000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_IN_DATA_VALID_BIT0_Pos 20UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_IN_DATA_VALID_BIT0_Msk 0x100000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_IN_DATA_VALID_BIT1_Pos 21UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_IN_DATA_VALID_BIT1_Msk 0x200000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_IN_DATA_VALID_BIT2_Pos 22UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_IN_DATA_VALID_BIT2_Msk 0x400000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_IN_DATA_VALID_BIT3_Pos 23UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_IN_DATA_VALID_BIT3_Msk 0x800000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_GPIF_ERR_Pos 24UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_GPIF_ERR_Msk 0x1000000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_INVLD_CMD_DET_Pos 25UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_INVLD_CMD_DET_Msk 0x2000000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_LINK_IDLE_Pos 26UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_LINK_IDLE_Msk 0x4000000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SPARE4_Pos   27UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SPARE4_Msk   0x8000000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SPARE5_Pos   28UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SPARE5_Msk   0x10000000UL
/* LVDSSS_LVDS_GPIF.GPIF_INTR_MASK */
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_GPIF_DONE_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_GPIF_DONE_Msk 0x1UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_GPIF_FSM_INTR_Pos 1UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_GPIF_FSM_INTR_Msk 0x2UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_SWITCH_TIMEOUT_Pos 2UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_SWITCH_TIMEOUT_Msk 0x4UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_CRC_ERROR_Pos 3UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_CRC_ERROR_Msk 0x8UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_ADDR_COUNT_HIT_Pos 4UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_ADDR_COUNT_HIT_Msk 0x10UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_DATA_COUNT_HIT_Pos 5UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_DATA_COUNT_HIT_Msk 0x20UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_CTRL_COUNT_HIT_Pos 6UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_CTRL_COUNT_HIT_Msk 0x40UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_ADDR_COMP_HIT_Pos 7UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_ADDR_COMP_HIT_Msk 0x80UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_DATA_COMP_HIT_Pos 8UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_DATA_COMP_HIT_Msk 0x100UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_CTRL_COMP_HIT_Pos 9UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_CTRL_COMP_HIT_Msk 0x200UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_WAVEFORM_BUSY_Pos 10UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_WAVEFORM_BUSY_Msk 0x400UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_EG_DATA_EMPTY_Pos 16UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_EG_DATA_EMPTY_Msk 0xF0000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_IN_DATA_VALID_Pos 20UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_IN_DATA_VALID_Msk 0xF00000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_GPIF_ERR_Pos 24UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_GPIF_ERR_Msk 0x1000000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_INVLD_CMD_DET_Pos 25UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_INVLD_CMD_DET_Msk 0x2000000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_LINK_IDLE_Pos 26UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_LINK_IDLE_Msk 0x4000000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_SPARE4_Pos 27UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_SPARE4_Msk 0x8000000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_SPARE5_Pos 28UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASK_SPARE5_Msk 0x10000000UL
/* LVDSSS_LVDS_GPIF.GPIF_INTR_MASKED */
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_GPIF_DONE_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_GPIF_DONE_Msk 0x1UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_GPIF_FSM_INTR_Pos 1UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_GPIF_FSM_INTR_Msk 0x2UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_SWITCH_TIMEOUT_Pos 2UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_SWITCH_TIMEOUT_Msk 0x4UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_CRC_ERROR_Pos 3UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_CRC_ERROR_Msk 0x8UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_ADDR_COUNT_HIT_Pos 4UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_ADDR_COUNT_HIT_Msk 0x10UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_DATA_COUNT_HIT_Pos 5UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_DATA_COUNT_HIT_Msk 0x20UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_CTRL_COUNT_HIT_Pos 6UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_CTRL_COUNT_HIT_Msk 0x40UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_ADDR_COMP_HIT_Pos 7UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_ADDR_COMP_HIT_Msk 0x80UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_DATA_COMP_HIT_Pos 8UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_DATA_COMP_HIT_Msk 0x100UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_CTRL_COMP_HIT_Pos 9UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_CTRL_COMP_HIT_Msk 0x200UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_WAVEFORM_BUSY_Pos 10UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_WAVEFORM_BUSY_Msk 0x400UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_EG_DATA_EMPTY_Pos 16UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_EG_DATA_EMPTY_Msk 0xF0000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_IN_DATA_VALID_Pos 20UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_IN_DATA_VALID_Msk 0xF00000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_GPIF_ERR_Pos 24UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_GPIF_ERR_Msk 0x1000000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_INVLD_CMD_DET_Pos 25UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_INVLD_CMD_DET_Msk 0x2000000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_LINK_IDLE_Pos 26UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_LINK_IDLE_Msk 0x4000000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_SPARE4_Pos 27UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_SPARE4_Msk 0x8000000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_SPARE5_Pos 28UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_MASKED_SPARE5_Msk 0x10000000UL
/* LVDSSS_LVDS_GPIF.GPIF_INTR_SET */
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_GPIF_DONE_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_GPIF_DONE_Msk 0x1UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_GPIF_FSM_INTR_Pos 1UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_GPIF_FSM_INTR_Msk 0x2UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_SWITCH_TIMEOUT_Pos 2UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_SWITCH_TIMEOUT_Msk 0x4UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_CRC_ERROR_Pos 3UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_CRC_ERROR_Msk 0x8UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_ADDR_COUNT_HIT_Pos 4UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_ADDR_COUNT_HIT_Msk 0x10UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_DATA_COUNT_HIT_Pos 5UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_DATA_COUNT_HIT_Msk 0x20UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_CTRL_COUNT_HIT_Pos 6UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_CTRL_COUNT_HIT_Msk 0x40UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_ADDR_COMP_HIT_Pos 7UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_ADDR_COMP_HIT_Msk 0x80UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_DATA_COMP_HIT_Pos 8UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_DATA_COMP_HIT_Msk 0x100UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_CTRL_COMP_HIT_Pos 9UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_CTRL_COMP_HIT_Msk 0x200UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_WAVEFORM_BUSY_Pos 10UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_WAVEFORM_BUSY_Msk 0x400UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_EG_DATA_EMPTY_Pos 16UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_EG_DATA_EMPTY_Msk 0xF0000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_IN_DATA_VALID_Pos 20UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_IN_DATA_VALID_Msk 0xF00000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_GPIF_ERR_Pos 24UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_GPIF_ERR_Msk 0x1000000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_INVLD_CMD_DET_Pos 25UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_INVLD_CMD_DET_Msk 0x2000000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_LINK_IDLE_Pos 26UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_LINK_IDLE_Msk 0x4000000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_SPARE4_Pos 27UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_SPARE4_Msk 0x8000000UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_SPARE5_Pos 28UL
#define LVDSSS_LVDS_GPIF_GPIF_INTR_SET_SPARE5_Msk 0x10000000UL
/* LVDSSS_LVDS_GPIF.GPIF_ERROR */
#define LVDSSS_LVDS_GPIF_GPIF_ERROR_GPIF_ERR_CODE_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_ERROR_GPIF_ERR_CODE_Msk 0x1FUL
/* LVDSSS_LVDS_GPIF.GPIF_CTRL_BUS_DIRECTION */
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_BUS_DIRECTION_INP_EN_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_BUS_DIRECTION_INP_EN_Msk 0x1UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_BUS_DIRECTION_OEN_Pos 1UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_BUS_DIRECTION_OEN_Msk 0x2UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_BUS_DIRECTION_BIDI_EN_Pos 2UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_BUS_DIRECTION_BIDI_EN_Msk 0x4UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_BUS_DIRECTION_OPEN_DRAIN_EN_Pos 3UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_BUS_DIRECTION_OPEN_DRAIN_EN_Msk 0x8UL
/* LVDSSS_LVDS_GPIF.GPIF_CTRL_BUS_DEFAULT */
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_BUS_DEFAULT_DEFAULT_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_BUS_DEFAULT_DEFAULT_Msk 0xFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_CTRL_BUS_POLARITY */
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_BUS_POLARITY_POLARITY_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_BUS_POLARITY_POLARITY_Msk 0xFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_CTRL_BUS_TOGGLE */
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_BUS_TOGGLE_TOGGLE_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_BUS_TOGGLE_TOGGLE_Msk 0xFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_CTRL_BUS_SELECT */
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_BUS_SELECT_OMEGA_INDEX_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_BUS_SELECT_OMEGA_INDEX_Msk 0x1FUL
/* LVDSSS_LVDS_GPIF.GPIF_CTRL_COUNT_CONFIG */
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_COUNT_CONFIG_ENABLE_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_COUNT_CONFIG_ENABLE_Msk 0x1UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_COUNT_CONFIG_DOWN_UP_CNTR_Pos 1UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_COUNT_CONFIG_DOWN_UP_CNTR_Msk 0x2UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_COUNT_CONFIG_RELOAD_CNTR_Pos 2UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_COUNT_CONFIG_RELOAD_CNTR_Msk 0x4UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_COUNT_CONFIG_SW_RESET_CNTR_Pos 3UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_COUNT_CONFIG_SW_RESET_CNTR_Msk 0x8UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_COUNT_CONFIG_CONNECT_Pos 4UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_COUNT_CONFIG_CONNECT_Msk 0xF0UL
/* LVDSSS_LVDS_GPIF.GPIF_CTRL_COUNT_RESET */
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_COUNT_RESET_RESET_LOAD_VAL_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_COUNT_RESET_RESET_LOAD_VAL_Msk 0xFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_CTRL_COUNT_LIMIT */
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_COUNT_LIMIT_LIMIT_VAL_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_COUNT_LIMIT_LIMIT_VAL_Msk 0xFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_ADDR_COUNT_CONFIG */
#define LVDSSS_LVDS_GPIF_GPIF_ADDR_COUNT_CONFIG_ENABLE_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_ADDR_COUNT_CONFIG_ENABLE_Msk 0x1UL
#define LVDSSS_LVDS_GPIF_GPIF_ADDR_COUNT_CONFIG_RELOAD_Pos 1UL
#define LVDSSS_LVDS_GPIF_GPIF_ADDR_COUNT_CONFIG_RELOAD_Msk 0x2UL
#define LVDSSS_LVDS_GPIF_GPIF_ADDR_COUNT_CONFIG_SW_RESET_Pos 2UL
#define LVDSSS_LVDS_GPIF_GPIF_ADDR_COUNT_CONFIG_SW_RESET_Msk 0x4UL
#define LVDSSS_LVDS_GPIF_GPIF_ADDR_COUNT_CONFIG_DOWN_UP_Pos 3UL
#define LVDSSS_LVDS_GPIF_GPIF_ADDR_COUNT_CONFIG_DOWN_UP_Msk 0x8UL
#define LVDSSS_LVDS_GPIF_GPIF_ADDR_COUNT_CONFIG_INCREMENT_Pos 8UL
#define LVDSSS_LVDS_GPIF_GPIF_ADDR_COUNT_CONFIG_INCREMENT_Msk 0xFF00UL
/* LVDSSS_LVDS_GPIF.GPIF_ADDR_COUNT_RESET */
#define LVDSSS_LVDS_GPIF_GPIF_ADDR_COUNT_RESET_RESET_LOAD_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_ADDR_COUNT_RESET_RESET_LOAD_Msk 0xFFFFFFFFUL
