RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_lvdsss.h
/* LVDSSS_LVDS_GPIF.GPIF_ADDR_COUNT_LIMIT */
#define LVDSSS_LVDS_GPIF_GPIF_ADDR_COUNT_LIMIT_LIMIT_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_ADDR_COUNT_LIMIT_LIMIT_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_STATE_COUNT_CONFIG */
#define LVDSSS_LVDS_GPIF_GPIF_STATE_COUNT_CONFIG_ENABLE_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_STATE_COUNT_CONFIG_ENABLE_Msk 0x1UL
#define LVDSSS_LVDS_GPIF_GPIF_STATE_COUNT_CONFIG_SW_RESET_STATE_CNT_Pos 1UL
#define LVDSSS_LVDS_GPIF_GPIF_STATE_COUNT_CONFIG_SW_RESET_STATE_CNT_Msk 0x2UL
/* LVDSSS_LVDS_GPIF.GPIF_STATE_COUNT_LIMIT */
#define LVDSSS_LVDS_GPIF_GPIF_STATE_COUNT_LIMIT_LIMIT_VAL_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_STATE_COUNT_LIMIT_LIMIT_VAL_Msk 0xFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_DATA_COUNT_CONFIG */
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COUNT_CONFIG_ENABLE_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COUNT_CONFIG_ENABLE_Msk 0x1UL
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COUNT_CONFIG_RELOAD_Pos 1UL
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COUNT_CONFIG_RELOAD_Msk 0x2UL
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COUNT_CONFIG_SW_RESET_Pos 2UL
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COUNT_CONFIG_SW_RESET_Msk 0x4UL
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COUNT_CONFIG_DOWN_UP_Pos 3UL
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COUNT_CONFIG_DOWN_UP_Msk 0x8UL
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COUNT_CONFIG_INCREMENT_Pos 8UL
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COUNT_CONFIG_INCREMENT_Msk 0xFF00UL
/* LVDSSS_LVDS_GPIF.GPIF_DATA_COUNT_RESET_LSB */
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COUNT_RESET_LSB_RESET_LOAD_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COUNT_RESET_LSB_RESET_LOAD_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_DATA_COUNT_RESET_MSB */
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COUNT_RESET_MSB_RESET_LOAD_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COUNT_RESET_MSB_RESET_LOAD_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_DATA_COUNT_LIMIT_LSB */
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COUNT_LIMIT_LSB_LIMIT_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COUNT_LIMIT_LSB_LIMIT_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_DATA_COUNT_LIMIT_MSB */
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COUNT_LIMIT_MSB_LIMIT_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COUNT_LIMIT_MSB_LIMIT_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_CTRL_COMP_VALUE */
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_COMP_VALUE_COMP_VALUE_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_COMP_VALUE_COMP_VALUE_Msk 0xFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_CTRL_COMP_MASK */
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_COMP_MASK_CTRL_COMP_MASK_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_CTRL_COMP_MASK_CTRL_COMP_MASK_Msk 0xFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_DATA_COMP_VALUE_WORD0 */
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COMP_VALUE_WORD0_VALUE_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COMP_VALUE_WORD0_VALUE_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_DATA_COMP_VALUE_WORD1 */
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COMP_VALUE_WORD1_VALUE_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COMP_VALUE_WORD1_VALUE_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_DATA_COMP_VALUE_WORD2 */
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COMP_VALUE_WORD2_VALUE_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COMP_VALUE_WORD2_VALUE_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_DATA_COMP_VALUE_WORD3 */
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COMP_VALUE_WORD3_VALUE_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COMP_VALUE_WORD3_VALUE_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_DATA_COMP_MASK_WORD0 */
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COMP_MASK_WORD0_MASK_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COMP_MASK_WORD0_MASK_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_DATA_COMP_MASK_WORD1 */
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COMP_MASK_WORD1_MASK_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COMP_MASK_WORD1_MASK_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_DATA_COMP_MASK_WORD2 */
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COMP_MASK_WORD2_MASK_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COMP_MASK_WORD2_MASK_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_DATA_COMP_MASK_WORD3 */
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COMP_MASK_WORD3_MASK_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_DATA_COMP_MASK_WORD3_MASK_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_ADDR_COMP_VALUE */
#define LVDSSS_LVDS_GPIF_GPIF_ADDR_COMP_VALUE_VALUE_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_ADDR_COMP_VALUE_VALUE_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_ADDR_COMP_MASK */
#define LVDSSS_LVDS_GPIF_GPIF_ADDR_COMP_MASK_MASK_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_ADDR_COMP_MASK_MASK_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_LAMBDA_STAT0 */
#define LVDSSS_LVDS_GPIF_GPIF_LAMBDA_STAT0_LAMBDA_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_LAMBDA_STAT0_LAMBDA_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_LAMBDA_STAT1 */
#define LVDSSS_LVDS_GPIF_GPIF_LAMBDA_STAT1_LAMBDA_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_LAMBDA_STAT1_LAMBDA_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_ALPHA_STAT */
#define LVDSSS_LVDS_GPIF_GPIF_ALPHA_STAT_ALPHA_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_ALPHA_STAT_ALPHA_Msk 0xFFUL
/* LVDSSS_LVDS_GPIF.GPIF_BETA_STAT */
#define LVDSSS_LVDS_GPIF_GPIF_BETA_STAT_BETA_VAL_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_BETA_STAT_BETA_VAL_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_WAVEFORM_CTRL_STAT */
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_CTRL_STAT_WAVEFORM_VALID_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_CTRL_STAT_WAVEFORM_VALID_Msk 0x1UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_CTRL_STAT_PAUSE_Pos 1UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_CTRL_STAT_PAUSE_Msk 0x2UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_CTRL_STAT_GPIF_STAT_Pos 8UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_CTRL_STAT_GPIF_STAT_Msk 0x700UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_CTRL_STAT_CPU_LAMBDA_Pos 11UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_CTRL_STAT_CPU_LAMBDA_Msk 0x800UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_CTRL_STAT_ALPHA_INIT_Pos 16UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_CTRL_STAT_ALPHA_INIT_Msk 0xFF0000UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_CTRL_STAT_CURRENT_STATE_Pos 24UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_CTRL_STAT_CURRENT_STATE_Msk 0xFF000000UL
/* LVDSSS_LVDS_GPIF.GPIF_WAVEFORM_SWITCH */
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_SWITCH_WAVEFORM_SWITCH_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_SWITCH_WAVEFORM_SWITCH_Msk 0x1UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_SWITCH_DONE_ENABLE_Pos 1UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_SWITCH_DONE_ENABLE_Msk 0x2UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_SWITCH_SWITCH_NOW_Pos 2UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_SWITCH_SWITCH_NOW_Msk 0x4UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_SWITCH_TIMEOUT_MODE_Pos 3UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_SWITCH_TIMEOUT_MODE_Msk 0x38UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_SWITCH_TIMEOUT_REACHED_Pos 6UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_SWITCH_TIMEOUT_REACHED_Msk 0x40UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_SWITCH_TERMINATED_Pos 7UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_SWITCH_TERMINATED_Msk 0x80UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_SWITCH_TERMINAL_STATE_Pos 8UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_SWITCH_TERMINAL_STATE_Msk 0xFF00UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_SWITCH_DESTINATION_STATE_Pos 16UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_SWITCH_DESTINATION_STATE_Msk 0xFF0000UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_SWITCH_DONE_STATE_Pos 24UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_SWITCH_DONE_STATE_Msk 0xFF000000UL
/* LVDSSS_LVDS_GPIF.GPIF_WAVEFORM_SWITCH_TIMEOUT */
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_SWITCH_TIMEOUT_RESET_LOAD_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_WAVEFORM_SWITCH_TIMEOUT_RESET_LOAD_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_CRC_CALC_CONFIG */
#define LVDSSS_LVDS_GPIF_GPIF_CRC_CALC_CONFIG_INIT_CRC_CTL_4MFSM_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_CRC_CALC_CONFIG_INIT_CRC_CTL_4MFSM_Msk 0x1UL
#define LVDSSS_LVDS_GPIF_GPIF_CRC_CALC_CONFIG_USE_CRC_CTL_4MFSM_Pos 1UL
#define LVDSSS_LVDS_GPIF_GPIF_CRC_CALC_CONFIG_USE_CRC_CTL_4MFSM_Msk 0x2UL
#define LVDSSS_LVDS_GPIF_GPIF_CRC_CALC_CONFIG_USE_CALC_CRC_4MFSM_Pos 2UL
#define LVDSSS_LVDS_GPIF_GPIF_CRC_CALC_CONFIG_USE_CALC_CRC_4MFSM_Msk 0x4UL
/* LVDSSS_LVDS_GPIF.GPIF_BETA_DEASSERT */
#define LVDSSS_LVDS_GPIF_GPIF_BETA_DEASSERT_APPLY_DEASSERT_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_BETA_DEASSERT_APPLY_DEASSERT_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_GPIF.GPIF_FUNCTION */
#define LVDSSS_LVDS_GPIF_GPIF_FUNCTION_FUNCTION_Pos 0UL
#define LVDSSS_LVDS_GPIF_GPIF_FUNCTION_FUNCTION_Msk 0xFFFFUL
/* LVDSSS_LVDS_GPIF.LINK_IDLE_CFG */
#define LVDSSS_LVDS_GPIF_LINK_IDLE_CFG_IDLE_CMD_CNT_Pos 0UL
#define LVDSSS_LVDS_GPIF_LINK_IDLE_CFG_IDLE_CMD_CNT_Msk 0xFFFFUL
/* LVDSSS_LVDS_GPIF.LVCMOS_CLK_OUT_CFG */
#define LVDSSS_LVDS_GPIF_LVCMOS_CLK_OUT_CFG_CLK_SRC_Pos 0UL
#define LVDSSS_LVDS_GPIF_LVCMOS_CLK_OUT_CFG_CLK_SRC_Msk 0x3UL
#define LVDSSS_LVDS_GPIF_LVCMOS_CLK_OUT_CFG_CLK_SRC_DIV_VAL_Pos 4UL
#define LVDSSS_LVDS_GPIF_LVCMOS_CLK_OUT_CFG_CLK_SRC_DIV_VAL_Msk 0x3F0UL


