RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_lvdsss.h
/* LVDSSS_LVDS_AFE.DLL_DFTLPF */
#define LVDSSS_LVDS_AFE_DLL_DFTLPF_EN_Pos       0UL
#define LVDSSS_LVDS_AFE_DLL_DFTLPF_EN_Msk       0x1UL
#define LVDSSS_LVDS_AFE_DLL_DFTLPF_FILT_SEL_Pos 1UL
#define LVDSSS_LVDS_AFE_DLL_DFTLPF_FILT_SEL_Msk 0x2UL
/* LVDSSS_LVDS_AFE.DLL_CONFIG */
#define LVDSSS_LVDS_AFE_DLL_CONFIG_DFT_RINGO_RST_Pos 0UL
#define LVDSSS_LVDS_AFE_DLL_CONFIG_DFT_RINGO_RST_Msk 0x1UL
/* LVDSSS_LVDS_AFE.DLL_STATUS */
#define LVDSSS_LVDS_AFE_DLL_STATUS_FT_Pos       0UL
#define LVDSSS_LVDS_AFE_DLL_STATUS_FT_Msk       0x3FUL
/* LVDSSS_LVDS_AFE.DLL_M_CONFIG */
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_EN_Pos     0UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_EN_Msk     0x1UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_CLK_SEL_Pos 1UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_CLK_SEL_Msk 0x2UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_INV_CLK_MUX_Pos 2UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_INV_CLK_MUX_Msk 0x4UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_DFT_EN_Pos 3UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_DFT_EN_Msk 0x8UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_DFT_TEST_CLK_EN_Pos 4UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_DFT_TEST_CLK_EN_Msk 0x10UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_DFT_BBPD_EN_Pos 5UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_DFT_BBPD_EN_Msk 0x20UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_DFT_BBPD_SEL_Pos 6UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_DFT_BBPD_SEL_Msk 0xC0UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_SPEED_MODE_Pos 8UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_SPEED_MODE_Msk 0x100UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_ADFT_EN_LV_Pos 9UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_ADFT_EN_LV_Msk 0x200UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_FLT_EN_Pos 10UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_FLT_EN_Msk 0x400UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_MDLL_SEL_PH_Pos 11UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_MDLL_SEL_PH_Msk 0x7800UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_MDLL_OW_PH_Pos 15UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_MDLL_OW_PH_Msk 0x8000UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_HSPEED_MFREQ_SEL_Pos 16UL
#define LVDSSS_LVDS_AFE_DLL_M_CONFIG_HSPEED_MFREQ_SEL_Msk 0x10000UL
/* LVDSSS_LVDS_AFE.DLL_M_STATUS */
#define LVDSSS_LVDS_AFE_DLL_M_STATUS_SEL_PH_Pos 0UL
#define LVDSSS_LVDS_AFE_DLL_M_STATUS_SEL_PH_Msk 0xFUL
#define LVDSSS_LVDS_AFE_DLL_M_STATUS_CT_Pos     4UL
#define LVDSSS_LVDS_AFE_DLL_M_STATUS_CT_Msk     0xF0UL
#define LVDSSS_LVDS_AFE_DLL_M_STATUS_BBPD_Pos   8UL
#define LVDSSS_LVDS_AFE_DLL_M_STATUS_BBPD_Msk   0x100UL
#define LVDSSS_LVDS_AFE_DLL_M_STATUS_DFT_BBPD_Pos 9UL
#define LVDSSS_LVDS_AFE_DLL_M_STATUS_DFT_BBPD_Msk 0x200UL
#define LVDSSS_LVDS_AFE_DLL_M_STATUS_CORRECT_PERIOD_Pos 10UL
#define LVDSSS_LVDS_AFE_DLL_M_STATUS_CORRECT_PERIOD_Msk 0x400UL
#define LVDSSS_LVDS_AFE_DLL_M_STATUS_DLL_LOCK_Pos 11UL
#define LVDSSS_LVDS_AFE_DLL_M_STATUS_DLL_LOCK_Msk 0x800UL
/* LVDSSS_LVDS_AFE.DLL_S_CONFIG */
#define LVDSSS_LVDS_AFE_DLL_S_CONFIG_INV_CLK_MUXED_Pos 0UL
#define LVDSSS_LVDS_AFE_DLL_S_CONFIG_INV_CLK_MUXED_Msk 0x1UL
#define LVDSSS_LVDS_AFE_DLL_S_CONFIG_SDLL_DFT_EN_Pos 1UL
#define LVDSSS_LVDS_AFE_DLL_S_CONFIG_SDLL_DFT_EN_Msk 0x2UL
#define LVDSSS_LVDS_AFE_DLL_S_CONFIG_SDLL_EN_Pos 2UL
#define LVDSSS_LVDS_AFE_DLL_S_CONFIG_SDLL_EN_Msk 0x4UL
#define LVDSSS_LVDS_AFE_DLL_S_CONFIG_DFT_LPF_EN_Pos 3UL
#define LVDSSS_LVDS_AFE_DLL_S_CONFIG_DFT_LPF_EN_Msk 0x8UL
#define LVDSSS_LVDS_AFE_DLL_S_CONFIG_SDLL_SEL_PH_Pos 4UL
#define LVDSSS_LVDS_AFE_DLL_S_CONFIG_SDLL_SEL_PH_Msk 0xF0UL
#define LVDSSS_LVDS_AFE_DLL_S_CONFIG_SDLL_OW_PH_Pos 8UL
#define LVDSSS_LVDS_AFE_DLL_S_CONFIG_SDLL_OW_PH_Msk 0x100UL
#define LVDSSS_LVDS_AFE_DLL_S_CONFIG_SDLL_SPEED_MODE_Pos 9UL
#define LVDSSS_LVDS_AFE_DLL_S_CONFIG_SDLL_SPEED_MODE_Msk 0x200UL
/* LVDSSS_LVDS_AFE.DLL_S_STATUS */
#define LVDSSS_LVDS_AFE_DLL_S_STATUS_SEL_PH_Pos 0UL
#define LVDSSS_LVDS_AFE_DLL_S_STATUS_SEL_PH_Msk 0xFUL
#define LVDSSS_LVDS_AFE_DLL_S_STATUS_CLK_DFT_Pos 4UL
#define LVDSSS_LVDS_AFE_DLL_S_STATUS_CLK_DFT_Msk 0x10UL
/* LVDSSS_LVDS_AFE.GENERAL_LICIO_CIO */
#define LVDSSS_LVDS_AFE_GENERAL_LICIO_CIO_LVDS_RTERM_EN_Pos 0UL
#define LVDSSS_LVDS_AFE_GENERAL_LICIO_CIO_LVDS_RTERM_EN_Msk 0x3FFUL
#define LVDSSS_LVDS_AFE_GENERAL_LICIO_CIO_LVCMOS_LB_EN_Pos 10UL
#define LVDSSS_LVDS_AFE_GENERAL_LICIO_CIO_LVCMOS_LB_EN_Msk 0x400UL
/* LVDSSS_LVDS_AFE.LICIO_CIO */
#define LVDSSS_LVDS_AFE_LICIO_CIO_LVCMOS_RX_EN_Pos 0UL
#define LVDSSS_LVDS_AFE_LICIO_CIO_LVCMOS_RX_EN_Msk 0x1UL
#define LVDSSS_LVDS_AFE_LICIO_CIO_LVCMOS_TX_EN_Pos 1UL
#define LVDSSS_LVDS_AFE_LICIO_CIO_LVCMOS_TX_EN_Msk 0x2UL
/* LVDSSS_LVDS_AFE.GENERAL_LICIO_LI */
#define LVDSSS_LVDS_AFE_GENERAL_LICIO_LI_LVDS_LB_EN_Pos 0UL
#define LVDSSS_LVDS_AFE_GENERAL_LICIO_LI_LVDS_LB_EN_Msk 0x1UL
#define LVDSSS_LVDS_AFE_GENERAL_LICIO_LI_LVDS_CONFIG_Pos 1UL
#define LVDSSS_LVDS_AFE_GENERAL_LICIO_LI_LVDS_CONFIG_Msk 0x6UL
/* LVDSSS_LVDS_AFE.LICIO_LI */
#define LVDSSS_LVDS_AFE_LICIO_LI_LVDS_RX_EN_Pos 0UL
#define LVDSSS_LVDS_AFE_LICIO_LI_LVDS_RX_EN_Msk 0x1UL
#define LVDSSS_LVDS_AFE_LICIO_LI_ATST_Pos       7UL
#define LVDSSS_LVDS_AFE_LICIO_LI_ATST_Msk       0x380UL
/* LVDSSS_LVDS_AFE.LICIO_VSSIO_IREF */
#define LVDSSS_LVDS_AFE_LICIO_VSSIO_IREF_EN_Pos 0UL
#define LVDSSS_LVDS_AFE_LICIO_VSSIO_IREF_EN_Msk 0x1UL
#define LVDSSS_LVDS_AFE_LICIO_VSSIO_IREF_IN_SEL_Pos 1UL
#define LVDSSS_LVDS_AFE_LICIO_VSSIO_IREF_IN_SEL_Msk 0x6UL
#define LVDSSS_LVDS_AFE_LICIO_VSSIO_IREF_ATST_EN_Pos 3UL
#define LVDSSS_LVDS_AFE_LICIO_VSSIO_IREF_ATST_EN_Msk 0x8UL
/* LVDSSS_LVDS_AFE.LICIO_LI_OUT_STATUS */
#define LVDSSS_LVDS_AFE_LICIO_LI_OUT_STATUS_LVDS_DATA_Pos 0UL
#define LVDSSS_LVDS_AFE_LICIO_LI_OUT_STATUS_LVDS_DATA_Msk 0xFFUL
#define LVDSSS_LVDS_AFE_LICIO_LI_OUT_STATUS_LVDS_CTRL_Pos 8UL
#define LVDSSS_LVDS_AFE_LICIO_LI_OUT_STATUS_LVDS_CTRL_Msk 0x100UL
#define LVDSSS_LVDS_AFE_LICIO_LI_OUT_STATUS_LVDS_CLK_Pos 9UL
#define LVDSSS_LVDS_AFE_LICIO_LI_OUT_STATUS_LVDS_CLK_Msk 0x200UL
/* LVDSSS_LVDS_AFE.PLL_CONFIG */
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_CP_CUR_TRIM_Pos 0UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_CP_CUR_TRIM_Msk 0x3UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_BYPASS_Pos 2UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_BYPASS_Msk 0x4UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_PFD_DELAY_Pos 3UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_PFD_DELAY_Msk 0x18UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_LD_DELAY_Pos 5UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_LD_DELAY_Msk 0x60UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_EN_Pos   7UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_EN_Msk   0x80UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_REG_VCO_BYPASS_Pos 8UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_REG_VCO_BYPASS_Msk 0x100UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_REF_SEL_Pos 9UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_REF_SEL_Msk 0x600UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_SUPPLY_EN_Pos 11UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_SUPPLY_EN_Msk 0x800UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_N_IN_DIV_Pos 12UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_N_IN_DIV_Msk 0x3000UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_N_SERIAL_DIV_Pos 15UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_N_SERIAL_DIV_Msk 0x18000UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_N_FRAME_DIV_Pos 17UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_N_FRAME_DIV_Msk 0x20000UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_N_FB_DIV_Pos 18UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_N_FB_DIV_Msk 0x3C0000UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_ATST_SEL_Pos 22UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_ATST_SEL_Msk 0x3C00000UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_RUN_AWAY_DIS_Pos 26UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_RUN_AWAY_DIS_Msk 0x4000000UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_RUN_AWAY_TRIM_Pos 27UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_RUN_AWAY_TRIM_Msk 0x18000000UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_RUN_AWAY_DEL_Pos 29UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_PLL_RUN_AWAY_DEL_Msk 0x60000000UL
/* LVDSSS_LVDS_AFE.PLL_CONFIG_2 */
#define LVDSSS_LVDS_AFE_PLL_CONFIG_2_PLL_REG_CORE_TRIM_Pos 0UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_2_PLL_REG_CORE_TRIM_Msk 0x7UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_2_PLL_CAL_UP_DN_Pos 3UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_2_PLL_CAL_UP_DN_Msk 0x78UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_2_PLL_RA_UP_TR_Pos 7UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_2_PLL_RA_UP_TR_Msk 0x180UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_2_PLL_VCO_GAIN_Pos 9UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_2_PLL_VCO_GAIN_Msk 0x1E00UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_2_PLL_FB_SEL_Pos 13UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_2_PLL_FB_SEL_Msk 0x6000UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_2_PLL_MD_Pos 15UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_2_PLL_MD_Msk 0x8000UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_2_PLL_CTRL_LOCK_DELAY_Pos 16UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_2_PLL_CTRL_LOCK_DELAY_Msk 0xFF0000UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_2_PLL_CTRL_LOCK_LOSS_DELAY_Pos 24UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_2_PLL_CTRL_LOCK_LOSS_DELAY_Msk 0x1F000000UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_2_PLL_CTRL_EN_OVRDE_Pos 29UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_2_PLL_CTRL_EN_OVRDE_Msk 0x20000000UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_2_PLL_CTRL_OVRDE_LOCK_VAL_Pos 30UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_2_PLL_CTRL_OVRDE_LOCK_VAL_Msk 0x40000000UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_2_PLL_CTRL_SOURCE_LOCK_Pos 31UL
#define LVDSSS_LVDS_AFE_PLL_CONFIG_2_PLL_CTRL_SOURCE_LOCK_Msk 0x80000000UL
/* LVDSSS_LVDS_AFE.PLL_STATUS */
#define LVDSSS_LVDS_AFE_PLL_STATUS_PLL_DFT_Pos  0UL
#define LVDSSS_LVDS_AFE_PLL_STATUS_PLL_DFT_Msk  0x1UL
#define LVDSSS_LVDS_AFE_PLL_STATUS_PLL_LOCK_Pos 1UL
#define LVDSSS_LVDS_AFE_PLL_STATUS_PLL_LOCK_Msk 0x2UL
#define LVDSSS_LVDS_AFE_PLL_STATUS_PLL_RUN_AWAY_STICKY_Pos 2UL
#define LVDSSS_LVDS_AFE_PLL_STATUS_PLL_RUN_AWAY_STICKY_Msk 0x4UL
/* LVDSSS_LVDS_AFE.REG_1P25 */
#define LVDSSS_LVDS_AFE_REG_1P25_IREF_DLL_SEL_Pos 0UL
#define LVDSSS_LVDS_AFE_REG_1P25_IREF_DLL_SEL_Msk 0x7UL
#define LVDSSS_LVDS_AFE_REG_1P25_ENABLE_Pos     3UL
#define LVDSSS_LVDS_AFE_REG_1P25_ENABLE_Msk     0x8UL
#define LVDSSS_LVDS_AFE_REG_1P25_USE_REG_Pos    4UL
#define LVDSSS_LVDS_AFE_REG_1P25_USE_REG_Msk    0x10UL
#define LVDSSS_LVDS_AFE_REG_1P25_ADFT_CTRL_Pos  5UL
#define LVDSSS_LVDS_AFE_REG_1P25_ADFT_CTRL_Msk  0x1E0UL
#define LVDSSS_LVDS_AFE_REG_1P25_ADFT_EN_Pos    9UL
#define LVDSSS_LVDS_AFE_REG_1P25_ADFT_EN_Msk    0x200UL
#define LVDSSS_LVDS_AFE_REG_1P25_BURN_IN_EN_Pos 10UL
#define LVDSSS_LVDS_AFE_REG_1P25_BURN_IN_EN_Msk 0x400UL
#define LVDSSS_LVDS_AFE_REG_1P25_TRIM_VREG_1P25_Pos 11UL
#define LVDSSS_LVDS_AFE_REG_1P25_TRIM_VREG_1P25_Msk 0x7800UL
/* LVDSSS_LVDS_AFE.RX */
#define LVDSSS_LVDS_AFE_RX_FIXTIME_FRAMECLK_Pos 0UL
#define LVDSSS_LVDS_AFE_RX_FIXTIME_FRAMECLK_Msk 0x1UL
#define LVDSSS_LVDS_AFE_RX_EN_DESER_Pos         1UL
#define LVDSSS_LVDS_AFE_RX_EN_DESER_Msk         0x2UL
#define LVDSSS_LVDS_AFE_RX_INV_CLK_FRAME_Pos    2UL
#define LVDSSS_LVDS_AFE_RX_INV_CLK_FRAME_Msk    0x4UL
#define LVDSSS_LVDS_AFE_RX_INV_CLK_SER_Pos      3UL
#define LVDSSS_LVDS_AFE_RX_INV_CLK_SER_Msk      0x8UL
#define LVDSSS_LVDS_AFE_RX_INV_DATA_SER_Pos     4UL
#define LVDSSS_LVDS_AFE_RX_INV_DATA_SER_Msk     0x10UL
#define LVDSSS_LVDS_AFE_RX_CLK_MUX_SEL_Pos      5UL
#define LVDSSS_LVDS_AFE_RX_CLK_MUX_SEL_Msk      0x60UL
/* LVDSSS_LVDS_AFE.GENERAL_RX */
#define LVDSSS_LVDS_AFE_GENERAL_RX_DR_MODE_Pos  0UL
#define LVDSSS_LVDS_AFE_GENERAL_RX_DR_MODE_Msk  0x1UL
#define LVDSSS_LVDS_AFE_GENERAL_RX_BER_RSTN_Pos 1UL
#define LVDSSS_LVDS_AFE_GENERAL_RX_BER_RSTN_Msk 0x2UL
#define LVDSSS_LVDS_AFE_GENERAL_RX_DLL_BYPASS_EN_Pos 2UL
#define LVDSSS_LVDS_AFE_GENERAL_RX_DLL_BYPASS_EN_Msk 0x4UL
#define LVDSSS_LVDS_AFE_GENERAL_RX_LSB_FIRST_MODE_Pos 3UL
#define LVDSSS_LVDS_AFE_GENERAL_RX_LSB_FIRST_MODE_Msk 0x8UL
/* LVDSSS_LVDS_AFE.GENERAL_RX_LVCMOS */
#define LVDSSS_LVDS_AFE_GENERAL_RX_LVCMOS_CLK_MODE_Pos 1UL
#define LVDSSS_LVDS_AFE_GENERAL_RX_LVCMOS_CLK_MODE_Msk 0x2UL
#define LVDSSS_LVDS_AFE_GENERAL_RX_LVCMOS_EN_DDR_Pos 2UL
#define LVDSSS_LVDS_AFE_GENERAL_RX_LVCMOS_EN_DDR_Msk 0x4UL
#define LVDSSS_LVDS_AFE_GENERAL_RX_LVCMOS_CLK_BYPASS_Pos 3UL
#define LVDSSS_LVDS_AFE_GENERAL_RX_LVCMOS_CLK_BYPASS_Msk 0x8UL
#define LVDSSS_LVDS_AFE_GENERAL_RX_LVCMOS_MUX_SEL_Pos 4UL
#define LVDSSS_LVDS_AFE_GENERAL_RX_LVCMOS_MUX_SEL_Msk 0x10UL
#define LVDSSS_LVDS_AFE_GENERAL_RX_LVCMOS_PLL_CLK_EN_Pos 5UL
#define LVDSSS_LVDS_AFE_GENERAL_RX_LVCMOS_PLL_CLK_EN_Msk 0x20UL
/* LVDSSS_LVDS_AFE.RX_LVCMOS */
#define LVDSSS_LVDS_AFE_RX_LVCMOS_EN_LVCMOS_Pos 0UL
#define LVDSSS_LVDS_AFE_RX_LVCMOS_EN_LVCMOS_Msk 0x1UL
/* LVDSSS_LVDS_AFE.PRBS_GEN */
#define LVDSSS_LVDS_AFE_PRBS_GEN_EN_Pos         0UL
#define LVDSSS_LVDS_AFE_PRBS_GEN_EN_Msk         0x1UL
#define LVDSSS_LVDS_AFE_PRBS_GEN_SEED_Pos       1UL
#define LVDSSS_LVDS_AFE_PRBS_GEN_SEED_Msk       0x3EUL
#define LVDSSS_LVDS_AFE_PRBS_GEN_DDR_EN_Pos     6UL
#define LVDSSS_LVDS_AFE_PRBS_GEN_DDR_EN_Msk     0x40UL
#define LVDSSS_LVDS_AFE_PRBS_GEN_MULT_ERR_EN_Pos 7UL
#define LVDSSS_LVDS_AFE_PRBS_GEN_MULT_ERR_EN_Msk 0x80UL
#define LVDSSS_LVDS_AFE_PRBS_GEN_CLK_SRC_Pos    8UL
#define LVDSSS_LVDS_AFE_PRBS_GEN_CLK_SRC_Msk    0x100UL
/* LVDSSS_LVDS_AFE.PHY_GENERAL_CONFIG */
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_DESKEW_ALGORITHM_Pos 0UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_DESKEW_ALGORITHM_Msk 0x3UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_ENABLE_SCANON_Pos 2UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_ENABLE_SCANON_Msk 0x4UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_ENABLE_V1P25_VCCD_Pos 3UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_ENABLE_V1P25_VCCD_Msk 0x8UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_ENABLE_V1P1_VCCD_Pos 4UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_ENABLE_V1P1_VCCD_Msk 0x10UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_ENABLE_VDDIO_Pos 5UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_ENABLE_VDDIO_Msk 0x20UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_LVCMOS_TX_CLKSEL_Pos 6UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_LVCMOS_TX_CLKSEL_Msk 0xC0UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_BERCLK_SKEW_MARGIN_Pos 8UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_BERCLK_SKEW_MARGIN_Msk 0x300UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_MONITOR_FREQ_Pos 10UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_MONITOR_FREQ_Msk 0x1C00UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_MONITOR_TIME_Pos 13UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_MONITOR_TIME_Msk 0xE000UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_MONITOR_NON_STOP_Pos 16UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_MONITOR_NON_STOP_Msk 0x10000UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_DESKEW_ERR_THRESH1_Pos 17UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_DESKEW_ERR_THRESH1_Msk 0xFE0000UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_DESKEW_ERR_THRESH2_Pos 24UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_DESKEW_ERR_THRESH2_Msk 0x7F000000UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_BIST_RLXD_MARGIN_SEL_Pos 31UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_BIST_RLXD_MARGIN_SEL_Msk 0x80000000UL
/* LVDSSS_LVDS_AFE.PHY_GENERAL_STATUS_1 */
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_1_PRBS_CHECKER_STATE_D0_Pos 0UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_1_PRBS_CHECKER_STATE_D0_Msk 0x3UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_1_PRBS_CHECKER_STATE_D1_Pos 2UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_1_PRBS_CHECKER_STATE_D1_Msk 0xCUL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_1_PRBS_CHECKER_STATE_D2_Pos 4UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_1_PRBS_CHECKER_STATE_D2_Msk 0x30UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_1_PRBS_CHECKER_STATE_D3_Pos 6UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_1_PRBS_CHECKER_STATE_D3_Msk 0xC0UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_1_PRBS_CHECKER_STATE_D4_Pos 8UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_1_PRBS_CHECKER_STATE_D4_Msk 0x300UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_1_PRBS_CHECKER_STATE_D5_Pos 10UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_1_PRBS_CHECKER_STATE_D5_Msk 0xC00UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_1_PRBS_CHECKER_STATE_D6_Pos 12UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_1_PRBS_CHECKER_STATE_D6_Msk 0x3000UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_1_PRBS_CHECKER_STATE_D7_Pos 14UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_1_PRBS_CHECKER_STATE_D7_Msk 0xC000UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_1_PRBS_CHECKER_STATE_CTRL_Pos 16UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_1_PRBS_CHECKER_STATE_CTRL_Msk 0x30000UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_1_PRBS_RUN_STATUS_Pos 18UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_1_PRBS_RUN_STATUS_Msk 0x40000UL
/* LVDSSS_LVDS_AFE.PHY_GENERAL_STATUS_2 */
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_LOOPBACK_STOPPED_Pos 0UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_LOOPBACK_STOPPED_Msk 0x1UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_MONITOR_RUNNING_Pos 1UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_MONITOR_RUNNING_Msk 0x2UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_MONITOR_COMPLETED_Pos 2UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_MONITOR_COMPLETED_Msk 0x4UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_DESKEW_RUNNING_Pos 3UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_DESKEW_RUNNING_Msk 0x8UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_DESKEW_COMPLETED_Pos 4UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_DESKEW_COMPLETED_Msk 0x10UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_MONITOR_ADJUST_FAIL_Pos 5UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_MONITOR_ADJUST_FAIL_Msk 0x20UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_OK_DLL_VCCD_Pos 6UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_OK_DLL_VCCD_Msk 0x40UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_OK_V1P1_VCCD_Pos 7UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_OK_V1P1_VCCD_Msk 0x80UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_OK_V1P25_VCCD_Pos 8UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_OK_V1P25_VCCD_Msk 0x100UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_PLL_LOCK_ACQUIRED_Pos 10UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_PLL_LOCK_ACQUIRED_Msk 0x400UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_PLL_LOCK_LOST_Pos 11UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_PLL_LOCK_LOST_Msk 0x800UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_MDLL_LOCK_ACQUIRED_Pos 12UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_MDLL_LOCK_ACQUIRED_Msk 0x1000UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_MDLL_LOCK_LOST_Pos 13UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_MDLL_LOCK_LOST_Msk 0x2000UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_BIST_MDLL_DONE_Pos 14UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_BIST_MDLL_DONE_Msk 0x4000UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_BIST_SDLL_DONE_Pos 15UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_STATUS_2_BIST_SDLL_DONE_Msk 0x8000UL
/* LVDSSS_LVDS_AFE.PHY_INTR */
#define LVDSSS_LVDS_AFE_PHY_INTR_LOOPBACK_STOPPED_Pos 0UL
#define LVDSSS_LVDS_AFE_PHY_INTR_LOOPBACK_STOPPED_Msk 0x1UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MONITOR_RUNNING_Pos 1UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MONITOR_RUNNING_Msk 0x2UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MONITOR_COMPLETED_Pos 2UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MONITOR_COMPLETED_Msk 0x4UL
#define LVDSSS_LVDS_AFE_PHY_INTR_DESKEW_RUNNING_Pos 3UL
#define LVDSSS_LVDS_AFE_PHY_INTR_DESKEW_RUNNING_Msk 0x8UL
#define LVDSSS_LVDS_AFE_PHY_INTR_DESKEW_COMPLETED_Pos 4UL
#define LVDSSS_LVDS_AFE_PHY_INTR_DESKEW_COMPLETED_Msk 0x10UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MONITOR_ADJUST_FAIL_Pos 5UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MONITOR_ADJUST_FAIL_Msk 0x20UL
#define LVDSSS_LVDS_AFE_PHY_INTR_OK_DLL_VCCD_Pos 6UL
#define LVDSSS_LVDS_AFE_PHY_INTR_OK_DLL_VCCD_Msk 0x40UL
#define LVDSSS_LVDS_AFE_PHY_INTR_OK_V1P1_VCCD_Pos 7UL
#define LVDSSS_LVDS_AFE_PHY_INTR_OK_V1P1_VCCD_Msk 0x80UL
#define LVDSSS_LVDS_AFE_PHY_INTR_OK_V1P25_VCCD_Pos 8UL
#define LVDSSS_LVDS_AFE_PHY_INTR_OK_V1P25_VCCD_Msk 0x100UL
#define LVDSSS_LVDS_AFE_PHY_INTR_GPIO_INTR_Pos  9UL
#define LVDSSS_LVDS_AFE_PHY_INTR_GPIO_INTR_Msk  0x200UL
#define LVDSSS_LVDS_AFE_PHY_INTR_PLL_LOCK_ACQUIRED_Pos 10UL
#define LVDSSS_LVDS_AFE_PHY_INTR_PLL_LOCK_ACQUIRED_Msk 0x400UL
#define LVDSSS_LVDS_AFE_PHY_INTR_PLL_LOCK_LOST_Pos 11UL
#define LVDSSS_LVDS_AFE_PHY_INTR_PLL_LOCK_LOST_Msk 0x800UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MDLL_LOCK_ACQUIRED_Pos 12UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MDLL_LOCK_ACQUIRED_Msk 0x1000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MDLL_LOCK_LOST_Pos 13UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MDLL_LOCK_LOST_Msk 0x2000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_BIST_MDLL_DONE_Pos 14UL
#define LVDSSS_LVDS_AFE_PHY_INTR_BIST_MDLL_DONE_Msk 0x4000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_BIST_SDLL_DONE_Pos 15UL
#define LVDSSS_LVDS_AFE_PHY_INTR_BIST_SDLL_DONE_Msk 0x8000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SAR_DONE_Pos   16UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SAR_DONE_Msk   0x10000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_ADC_CMP_OUT_POS_EDGE_Pos 17UL
#define LVDSSS_LVDS_AFE_PHY_INTR_ADC_CMP_OUT_POS_EDGE_Msk 0x20000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_ADC_CMP_OUT_FALL_EDGE_Pos 18UL
#define LVDSSS_LVDS_AFE_PHY_INTR_ADC_CMP_OUT_FALL_EDGE_Msk 0x40000UL
/* LVDSSS_LVDS_AFE.PHY_INTR_MASK */
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_LOOPBACK_STOPPED_Pos 0UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_LOOPBACK_STOPPED_Msk 0x1UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_MONITOR_RUNNING_Pos 1UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_MONITOR_RUNNING_Msk 0x2UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_MONITOR_COMPLETED_Pos 2UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_MONITOR_COMPLETED_Msk 0x4UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_DESKEW_RUNNING_Pos 3UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_DESKEW_RUNNING_Msk 0x8UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_DESKEW_COMPLETED_Pos 4UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_DESKEW_COMPLETED_Msk 0x10UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_MONITOR_ADJUST_FAIL_Pos 5UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_MONITOR_ADJUST_FAIL_Msk 0x20UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_OK_DLL_VCCD_Pos 6UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_OK_DLL_VCCD_Msk 0x40UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_OK_V1P1_VCCD_Pos 7UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_OK_V1P1_VCCD_Msk 0x80UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_OK_V1P25_VCCD_Pos 8UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_OK_V1P25_VCCD_Msk 0x100UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_GPIO_INTR_Pos 9UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_GPIO_INTR_Msk 0x200UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_PLL_LOCK_ACQUIRED_Pos 10UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_PLL_LOCK_ACQUIRED_Msk 0x400UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_PLL_LOCK_LOST_Pos 11UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_PLL_LOCK_LOST_Msk 0x800UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_MDLL_LOCK_ACQUIRED_Pos 12UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_MDLL_LOCK_ACQUIRED_Msk 0x1000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_MDLL_LOCK_LOST_Pos 13UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_MDLL_LOCK_LOST_Msk 0x2000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_BIST_MDLL_DONE_Pos 14UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_BIST_MDLL_DONE_Msk 0x4000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_BIST_SDLL_DONE_Pos 15UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_BIST_SDLL_DONE_Msk 0x8000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_SAR_DONE_Pos 16UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_SAR_DONE_Msk 0x10000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_ADC_CMP_OUT_POS_EDGE_Pos 17UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_ADC_CMP_OUT_POS_EDGE_Msk 0x20000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_ADC_CMP_OUT_FALL_EDGE_Pos 18UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASK_ADC_CMP_OUT_FALL_EDGE_Msk 0x40000UL
/* LVDSSS_LVDS_AFE.PHY_INTR_MASKED */
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_LOOPBACK_STOPPED_Pos 0UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_LOOPBACK_STOPPED_Msk 0x1UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_MONITOR_RUNNING_Pos 1UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_MONITOR_RUNNING_Msk 0x2UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_MONITOR_COMPLETED_Pos 2UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_MONITOR_COMPLETED_Msk 0x4UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_DESKEW_RUNNING_Pos 3UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_DESKEW_RUNNING_Msk 0x8UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_DESKEW_COMPLETED_Pos 4UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_DESKEW_COMPLETED_Msk 0x10UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_MONITOR_ADJUST_FAIL_Pos 5UL
