RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_lvdsss.h
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_MONITOR_ADJUST_FAIL_Msk 0x20UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_OK_DLL_VCCD_Pos 6UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_OK_DLL_VCCD_Msk 0x40UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_OK_V1P1_VCCD_Pos 7UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_OK_V1P1_VCCD_Msk 0x80UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_OK_V1P25_VCCD_Pos 8UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_OK_V1P25_VCCD_Msk 0x100UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_GPIO_INTR_Pos 9UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_GPIO_INTR_Msk 0x200UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_PLL_LOCK_ACQUIRED_Pos 10UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_PLL_LOCK_ACQUIRED_Msk 0x400UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_PLL_LOCK_LOST_Pos 11UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_PLL_LOCK_LOST_Msk 0x800UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_MDLL_LOCK_ACQUIRED_Pos 12UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_MDLL_LOCK_ACQUIRED_Msk 0x1000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_MDLL_LOCK_LOST_Pos 13UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_MDLL_LOCK_LOST_Msk 0x2000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_BIST_MDLL_DONE_Pos 14UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_BIST_MDLL_DONE_Msk 0x4000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_BIST_SDLL_DONE_Pos 15UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_BIST_SDLL_DONE_Msk 0x8000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_SAR_DONE_Pos 16UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_SAR_DONE_Msk 0x10000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_ADC_CMP_OUT_POS_EDGE_Pos 17UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_ADC_CMP_OUT_POS_EDGE_Msk 0x20000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_ADC_CMP_OUT_FALL_EDGE_Pos 18UL
#define LVDSSS_LVDS_AFE_PHY_INTR_MASKED_ADC_CMP_OUT_FALL_EDGE_Msk 0x40000UL
/* LVDSSS_LVDS_AFE.PHY_INTR_SET */
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_LOOPBACK_STOPPED_Pos 0UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_LOOPBACK_STOPPED_Msk 0x1UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_MONITOR_RUNNING_Pos 1UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_MONITOR_RUNNING_Msk 0x2UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_MONITOR_COMPLETED_Pos 2UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_MONITOR_COMPLETED_Msk 0x4UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_DESKEW_RUNNING_Pos 3UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_DESKEW_RUNNING_Msk 0x8UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_DESKEW_COMPLETED_Pos 4UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_DESKEW_COMPLETED_Msk 0x10UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_MONITOR_ADJUST_FAIL_Pos 5UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_MONITOR_ADJUST_FAIL_Msk 0x20UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_OK_DLL_VCCD_Pos 6UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_OK_DLL_VCCD_Msk 0x40UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_OK_V1P1_VCCD_Pos 7UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_OK_V1P1_VCCD_Msk 0x80UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_OK_V1P25_VCCD_Pos 8UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_OK_V1P25_VCCD_Msk 0x100UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_GPIO_INTR_Pos 9UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_GPIO_INTR_Msk 0x200UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_PLL_LOCK_ACQUIRED_Pos 10UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_PLL_LOCK_ACQUIRED_Msk 0x400UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_PLL_LOCK_LOST_Pos 11UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_PLL_LOCK_LOST_Msk 0x800UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_MDLL_LOCK_ACQUIRED_Pos 12UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_MDLL_LOCK_ACQUIRED_Msk 0x1000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_MDLL_LOCK_LOST_Pos 13UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_MDLL_LOCK_LOST_Msk 0x2000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_BIST_MDLL_DONE_Pos 14UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_BIST_MDLL_DONE_Msk 0x4000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_BIST_SDLL_DONE_Pos 15UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_BIST_SDLL_DONE_Msk 0x8000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_SAR_DONE_Pos 16UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_SAR_DONE_Msk 0x10000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_ADC_CMP_OUT_POS_EDGE_Pos 17UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_ADC_CMP_OUT_POS_EDGE_Msk 0x20000UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_ADC_CMP_OUT_FALL_EDGE_Pos 18UL
#define LVDSSS_LVDS_AFE_PHY_INTR_SET_ADC_CMP_OUT_FALL_EDGE_Msk 0x40000UL
/* LVDSSS_LVDS_AFE.PHY_TRAIN_CONFIG */
#define LVDSSS_LVDS_AFE_PHY_TRAIN_CONFIG_TRAIN_EN_Pos 0UL
#define LVDSSS_LVDS_AFE_PHY_TRAIN_CONFIG_TRAIN_EN_Msk 0x1UL
#define LVDSSS_LVDS_AFE_PHY_TRAIN_CONFIG_TRAIN_SEQ_Pos 1UL
#define LVDSSS_LVDS_AFE_PHY_TRAIN_CONFIG_TRAIN_SEQ_Msk 0x1FEUL
#define LVDSSS_LVDS_AFE_PHY_TRAIN_CONFIG_TRAIN_CYCLES_NO_Pos 9UL
#define LVDSSS_LVDS_AFE_PHY_TRAIN_CONFIG_TRAIN_CYCLES_NO_Msk 0xFE00UL
/* LVDSSS_LVDS_AFE.PHY_ADC_CONFIG */
#define LVDSSS_LVDS_AFE_PHY_ADC_CONFIG_DAC_CNTRL_Pos 0UL
#define LVDSSS_LVDS_AFE_PHY_ADC_CONFIG_DAC_CNTRL_Msk 0xFFUL
#define LVDSSS_LVDS_AFE_PHY_ADC_CONFIG_MID_VAL_Pos 8UL
#define LVDSSS_LVDS_AFE_PHY_ADC_CONFIG_MID_VAL_Msk 0xFF00UL
#define LVDSSS_LVDS_AFE_PHY_ADC_CONFIG_LDO_TRIM_Pos 16UL
#define LVDSSS_LVDS_AFE_PHY_ADC_CONFIG_LDO_TRIM_Msk 0xF0000UL
#define LVDSSS_LVDS_AFE_PHY_ADC_CONFIG_LDO_EN_Pos 20UL
#define LVDSSS_LVDS_AFE_PHY_ADC_CONFIG_LDO_EN_Msk 0x100000UL
#define LVDSSS_LVDS_AFE_PHY_ADC_CONFIG_ISO_N_Pos 21UL
#define LVDSSS_LVDS_AFE_PHY_ADC_CONFIG_ISO_N_Msk 0x200000UL
#define LVDSSS_LVDS_AFE_PHY_ADC_CONFIG_PD_LV_Pos 22UL
#define LVDSSS_LVDS_AFE_PHY_ADC_CONFIG_PD_LV_Msk 0x400000UL
#define LVDSSS_LVDS_AFE_PHY_ADC_CONFIG_DFT_MUXSEL_Pos 23UL
#define LVDSSS_LVDS_AFE_PHY_ADC_CONFIG_DFT_MUXSEL_Msk 0x800000UL
#define LVDSSS_LVDS_AFE_PHY_ADC_CONFIG_VSEL_Pos 24UL
#define LVDSSS_LVDS_AFE_PHY_ADC_CONFIG_VSEL_Msk 0x7000000UL
#define LVDSSS_LVDS_AFE_PHY_ADC_CONFIG_VREF_DAC_SEL_Pos 27UL
#define LVDSSS_LVDS_AFE_PHY_ADC_CONFIG_VREF_DAC_SEL_Msk 0x18000000UL
#define LVDSSS_LVDS_AFE_PHY_ADC_CONFIG_SAR_EN_Pos 29UL
#define LVDSSS_LVDS_AFE_PHY_ADC_CONFIG_SAR_EN_Msk 0x20000000UL
/* LVDSSS_LVDS_AFE.PHY_DDFT_MUX_SEL */
#define LVDSSS_LVDS_AFE_PHY_DDFT_MUX_SEL_DDFT0_MUX_SEL_Pos 0UL
#define LVDSSS_LVDS_AFE_PHY_DDFT_MUX_SEL_DDFT0_MUX_SEL_Msk 0x3FUL
#define LVDSSS_LVDS_AFE_PHY_DDFT_MUX_SEL_DDFT0_LVCMOSOUT_SEL_Pos 6UL
#define LVDSSS_LVDS_AFE_PHY_DDFT_MUX_SEL_DDFT0_LVCMOSOUT_SEL_Msk 0x40UL
#define LVDSSS_LVDS_AFE_PHY_DDFT_MUX_SEL_DDFT0_LINK_SEL_Pos 7UL
#define LVDSSS_LVDS_AFE_PHY_DDFT_MUX_SEL_DDFT0_LINK_SEL_Msk 0x80UL
#define LVDSSS_LVDS_AFE_PHY_DDFT_MUX_SEL_DDFT1_MUX_SEL_Pos 8UL
#define LVDSSS_LVDS_AFE_PHY_DDFT_MUX_SEL_DDFT1_MUX_SEL_Msk 0x3F00UL
#define LVDSSS_LVDS_AFE_PHY_DDFT_MUX_SEL_DDFT1_LVCMOSOUT_SEL_Pos 14UL
#define LVDSSS_LVDS_AFE_PHY_DDFT_MUX_SEL_DDFT1_LVCMOSOUT_SEL_Msk 0x4000UL
#define LVDSSS_LVDS_AFE_PHY_DDFT_MUX_SEL_DDFT1_LINK_SEL_Pos 15UL
#define LVDSSS_LVDS_AFE_PHY_DDFT_MUX_SEL_DDFT1_LINK_SEL_Msk 0x8000UL
#define LVDSSS_LVDS_AFE_PHY_DDFT_MUX_SEL_GPIO0_MUX_SEL_Pos 16UL
#define LVDSSS_LVDS_AFE_PHY_DDFT_MUX_SEL_GPIO0_MUX_SEL_Msk 0x3F0000UL
#define LVDSSS_LVDS_AFE_PHY_DDFT_MUX_SEL_GPIO0_LINK_SEL_Pos 23UL
#define LVDSSS_LVDS_AFE_PHY_DDFT_MUX_SEL_GPIO0_LINK_SEL_Msk 0x800000UL
#define LVDSSS_LVDS_AFE_PHY_DDFT_MUX_SEL_GPIO1_MUX_SEL_Pos 24UL
#define LVDSSS_LVDS_AFE_PHY_DDFT_MUX_SEL_GPIO1_MUX_SEL_Msk 0x3F000000UL
#define LVDSSS_LVDS_AFE_PHY_DDFT_MUX_SEL_GPIO1_LINK_SEL_Pos 31UL
#define LVDSSS_LVDS_AFE_PHY_DDFT_MUX_SEL_GPIO1_LINK_SEL_Msk 0x80000000UL
/* LVDSSS_LVDS_AFE.LICIO_VCCD_V1P1 */
#define LVDSSS_LVDS_AFE_LICIO_VCCD_V1P1_EN_Pos  0UL
#define LVDSSS_LVDS_AFE_LICIO_VCCD_V1P1_EN_Msk  0x1UL
#define LVDSSS_LVDS_AFE_LICIO_VCCD_V1P1_ATST_EN_Pos 3UL
#define LVDSSS_LVDS_AFE_LICIO_VCCD_V1P1_ATST_EN_Msk 0x8UL
/* LVDSSS_LVDS_AFE.PHY_GPIO */
#define LVDSSS_LVDS_AFE_PHY_GPIO_OUT_VALUE_Pos  0UL
#define LVDSSS_LVDS_AFE_PHY_GPIO_OUT_VALUE_Msk  0x1UL
#define LVDSSS_LVDS_AFE_PHY_GPIO_IN_VALUE_Pos   1UL
#define LVDSSS_LVDS_AFE_PHY_GPIO_IN_VALUE_Msk   0x2UL
#define LVDSSS_LVDS_AFE_PHY_GPIO_OUTPUT_EN_Pos  2UL
#define LVDSSS_LVDS_AFE_PHY_GPIO_OUTPUT_EN_Msk  0x4UL
#define LVDSSS_LVDS_AFE_PHY_GPIO_INPUT_EN_Pos   3UL
#define LVDSSS_LVDS_AFE_PHY_GPIO_INPUT_EN_Msk   0x8UL
#define LVDSSS_LVDS_AFE_PHY_GPIO_GPIO_ENABLE_Pos 31UL
#define LVDSSS_LVDS_AFE_PHY_GPIO_GPIO_ENABLE_Msk 0x80000000UL
/* LVDSSS_LVDS_AFE.PHY_GPIO_INTR_CFG */
#define LVDSSS_LVDS_AFE_PHY_GPIO_INTR_CFG_GPIO_INTR_PIN_SEL_Pos 0UL
#define LVDSSS_LVDS_AFE_PHY_GPIO_INTR_CFG_GPIO_INTR_PIN_SEL_Msk 0x1FUL
#define LVDSSS_LVDS_AFE_PHY_GPIO_INTR_CFG_INTRMODE_Pos 8UL
#define LVDSSS_LVDS_AFE_PHY_GPIO_INTR_CFG_INTRMODE_Msk 0x700UL
/* LVDSSS_LVDS_AFE.PHY_GENERAL_CONFIG_2 */
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_2_CNT_10US24_VAL_Pos 0UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_2_CNT_10US24_VAL_Msk 0xFFFFUL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_2_MONITOR_ERR_THRESH_Pos 16UL
#define LVDSSS_LVDS_AFE_PHY_GENERAL_CONFIG_2_MONITOR_ERR_THRESH_Msk 0xFFFF0000UL
/* LVDSSS_LVDS_AFE.PRBS_STATUS */
#define LVDSSS_LVDS_AFE_PRBS_STATUS_BER_COUNTER_Pos 0UL
#define LVDSSS_LVDS_AFE_PRBS_STATUS_BER_COUNTER_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_AFE.LVDS_STATUS_MONITOR */
#define LVDSSS_LVDS_AFE_LVDS_STATUS_MONITOR_LVDS_PAD_VALUE_Pos 0UL
#define LVDSSS_LVDS_AFE_LVDS_STATUS_MONITOR_LVDS_PAD_VALUE_Msk 0x1UL
#define LVDSSS_LVDS_AFE_LVDS_STATUS_MONITOR_LVDS_PAD_RDEN_Pos 1UL
#define LVDSSS_LVDS_AFE_LVDS_STATUS_MONITOR_LVDS_PAD_RDEN_Msk 0x2UL
/* LVDSSS_LVDS_AFE.PHY_ADC_STATUS */
#define LVDSSS_LVDS_AFE_PHY_ADC_STATUS_CMP_OUT_Pos 0UL
#define LVDSSS_LVDS_AFE_PHY_ADC_STATUS_CMP_OUT_Msk 0x1UL
#define LVDSSS_LVDS_AFE_PHY_ADC_STATUS_SAR_OUT_Pos 8UL
#define LVDSSS_LVDS_AFE_PHY_ADC_STATUS_SAR_OUT_Msk 0xFF00UL
/* LVDSSS_LVDS_AFE.FRM_CLK_GLITCH_FILTER */
#define LVDSSS_LVDS_AFE_FRM_CLK_GLITCH_FILTER_CLKGATE_DURATION_Pos 0UL
#define LVDSSS_LVDS_AFE_FRM_CLK_GLITCH_FILTER_CLKGATE_DURATION_Msk 0xFFUL
#define LVDSSS_LVDS_AFE_FRM_CLK_GLITCH_FILTER_PHASE_CHNG_EFFECT_TIME_Pos 8UL
#define LVDSSS_LVDS_AFE_FRM_CLK_GLITCH_FILTER_PHASE_CHNG_EFFECT_TIME_Msk 0xFF00UL
#define LVDSSS_LVDS_AFE_FRM_CLK_GLITCH_FILTER_BYPASS_GLITCH_FILTER_Pos 16UL
#define LVDSSS_LVDS_AFE_FRM_CLK_GLITCH_FILTER_BYPASS_GLITCH_FILTER_Msk 0x10000UL
/* LVDSSS_LVDS_AFE.LICIO_CIO_CTRL_DS */
#define LVDSSS_LVDS_AFE_LICIO_CIO_CTRL_DS_DS_Pos 0UL
#define LVDSSS_LVDS_AFE_LICIO_CIO_CTRL_DS_DS_Msk 0x1FUL
#define LVDSSS_LVDS_AFE_LICIO_CIO_CTRL_DS_SR_Pos 8UL
#define LVDSSS_LVDS_AFE_LICIO_CIO_CTRL_DS_SR_Msk 0x300UL
/* LVDSSS_LVDS_AFE.LICIO_CIO_DATA_DS */
#define LVDSSS_LVDS_AFE_LICIO_CIO_DATA_DS_DS_Pos 0UL
#define LVDSSS_LVDS_AFE_LICIO_CIO_DATA_DS_DS_Msk 0x1FUL
#define LVDSSS_LVDS_AFE_LICIO_CIO_DATA_DS_SR_Pos 8UL
#define LVDSSS_LVDS_AFE_LICIO_CIO_DATA_DS_SR_Msk 0x300UL
/* LVDSSS_LVDS_AFE.DLY_CELL_LOAD */
#define LVDSSS_LVDS_AFE_DLY_CELL_LOAD_LOAD_Pos  0UL
#define LVDSSS_LVDS_AFE_DLY_CELL_LOAD_LOAD_Msk  0x3UL
/* LVDSSS_LVDS_AFE.SAR_CLK_FREQ_CFG */
#define LVDSSS_LVDS_AFE_SAR_CLK_FREQ_CFG_CLK_DIV_Pos 0UL
#define LVDSSS_LVDS_AFE_SAR_CLK_FREQ_CFG_CLK_DIV_Msk 0x3UL
/* LVDSSS_LVDS_AFE.STUCK_AT_CNTRS */
#define LVDSSS_LVDS_AFE_STUCK_AT_CNTRS_CNTR0_Pos 0UL
#define LVDSSS_LVDS_AFE_STUCK_AT_CNTRS_CNTR0_Msk 0xFUL
#define LVDSSS_LVDS_AFE_STUCK_AT_CNTRS_CNTR1_Pos 4UL
#define LVDSSS_LVDS_AFE_STUCK_AT_CNTRS_CNTR1_Msk 0xF0UL
#define LVDSSS_LVDS_AFE_STUCK_AT_CNTRS_CNTR2_Pos 8UL
#define LVDSSS_LVDS_AFE_STUCK_AT_CNTRS_CNTR2_Msk 0xF00UL
#define LVDSSS_LVDS_AFE_STUCK_AT_CNTRS_CNTR3_Pos 12UL
#define LVDSSS_LVDS_AFE_STUCK_AT_CNTRS_CNTR3_Msk 0xF000UL
#define LVDSSS_LVDS_AFE_STUCK_AT_CNTRS_CNTR4_Pos 16UL
#define LVDSSS_LVDS_AFE_STUCK_AT_CNTRS_CNTR4_Msk 0xF0000UL
#define LVDSSS_LVDS_AFE_STUCK_AT_CNTRS_CNTR5_Pos 20UL
#define LVDSSS_LVDS_AFE_STUCK_AT_CNTRS_CNTR5_Msk 0xF00000UL
#define LVDSSS_LVDS_AFE_STUCK_AT_CNTRS_CNTR6_Pos 24UL
#define LVDSSS_LVDS_AFE_STUCK_AT_CNTRS_CNTR6_Msk 0xF000000UL
#define LVDSSS_LVDS_AFE_STUCK_AT_CNTRS_CNTR7_Pos 28UL
#define LVDSSS_LVDS_AFE_STUCK_AT_CNTRS_CNTR7_Msk 0xF0000000UL
/* LVDSSS_LVDS_AFE.STUCK_CNTR_RST_CTL */
#define LVDSSS_LVDS_AFE_STUCK_CNTR_RST_CTL_CNTR_RST_Pos 0UL
#define LVDSSS_LVDS_AFE_STUCK_CNTR_RST_CTL_CNTR_RST_Msk 0xFFUL
/* LVDSSS_LVDS_AFE.STUCK_CNTR_SIG_SEL_0 */
#define LVDSSS_LVDS_AFE_STUCK_CNTR_SIG_SEL_0_SIG_SEL_OF_CNTR_0_Pos 0UL
#define LVDSSS_LVDS_AFE_STUCK_CNTR_SIG_SEL_0_SIG_SEL_OF_CNTR_0_Msk 0xFFUL
#define LVDSSS_LVDS_AFE_STUCK_CNTR_SIG_SEL_0_SIG_SEL_OF_CNTR_1_Pos 8UL
#define LVDSSS_LVDS_AFE_STUCK_CNTR_SIG_SEL_0_SIG_SEL_OF_CNTR_1_Msk 0xFF00UL
#define LVDSSS_LVDS_AFE_STUCK_CNTR_SIG_SEL_0_SIG_SEL_OF_CNTR_2_Pos 16UL
#define LVDSSS_LVDS_AFE_STUCK_CNTR_SIG_SEL_0_SIG_SEL_OF_CNTR_2_Msk 0xFF0000UL
#define LVDSSS_LVDS_AFE_STUCK_CNTR_SIG_SEL_0_SIG_SEL_OF_CNTR_3_Pos 24UL
#define LVDSSS_LVDS_AFE_STUCK_CNTR_SIG_SEL_0_SIG_SEL_OF_CNTR_3_Msk 0xFF000000UL
/* LVDSSS_LVDS_AFE.STUCK_CNTR_SIG_SEL_1 */
#define LVDSSS_LVDS_AFE_STUCK_CNTR_SIG_SEL_1_SIG_SEL_OF_CNTR_4_Pos 0UL
#define LVDSSS_LVDS_AFE_STUCK_CNTR_SIG_SEL_1_SIG_SEL_OF_CNTR_4_Msk 0xFFUL
#define LVDSSS_LVDS_AFE_STUCK_CNTR_SIG_SEL_1_SIG_SEL_OF_CNTR_5_Pos 8UL
#define LVDSSS_LVDS_AFE_STUCK_CNTR_SIG_SEL_1_SIG_SEL_OF_CNTR_5_Msk 0xFF00UL
#define LVDSSS_LVDS_AFE_STUCK_CNTR_SIG_SEL_1_SIG_SEL_OF_CNTR_6_Pos 16UL
#define LVDSSS_LVDS_AFE_STUCK_CNTR_SIG_SEL_1_SIG_SEL_OF_CNTR_6_Msk 0xFF0000UL
#define LVDSSS_LVDS_AFE_STUCK_CNTR_SIG_SEL_1_SIG_SEL_OF_CNTR_7_Pos 24UL
#define LVDSSS_LVDS_AFE_STUCK_CNTR_SIG_SEL_1_SIG_SEL_OF_CNTR_7_Msk 0xFF000000UL
/* LVDSSS_LVDS_AFE.CTL_PIN_SDLL_CFG */
#define LVDSSS_LVDS_AFE_CTL_PIN_SDLL_CFG_CTL_PIN_SEL_Pos 0UL
#define LVDSSS_LVDS_AFE_CTL_PIN_SDLL_CFG_CTL_PIN_SEL_Msk 0xFUL
#define LVDSSS_LVDS_AFE_CTL_PIN_SDLL_CFG_EN_SDLL_CLK_MON_Pos 4UL
#define LVDSSS_LVDS_AFE_CTL_PIN_SDLL_CFG_EN_SDLL_CLK_MON_Msk 0x10UL
/* LVDSSS_LVDS_AFE.LVDS_BER_STATUS */
#define LVDSSS_LVDS_AFE_LVDS_BER_STATUS_LVDS_DATA_BER_Pos 0UL
#define LVDSSS_LVDS_AFE_LVDS_BER_STATUS_LVDS_DATA_BER_Msk 0xFFUL
#define LVDSSS_LVDS_AFE_LVDS_BER_STATUS_LVDS_CTRL_BER_Pos 8UL
#define LVDSSS_LVDS_AFE_LVDS_BER_STATUS_LVDS_CTRL_BER_Msk 0x100UL


/* LVDSSS_LVDS_ADAPTER_DMA_SCK.SCK_DSCR */
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_DSCR_NUMBER_Pos 0UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_DSCR_NUMBER_Msk 0xFFFFUL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_DSCR_COUNT_Pos 16UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_DSCR_COUNT_Msk 0xFF0000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_DSCR_LOW_Pos 24UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_DSCR_LOW_Msk 0xFF000000UL
/* LVDSSS_LVDS_ADAPTER_DMA_SCK.SCK_SIZE */
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_SIZE_TRANS_SIZE_Pos 0UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_SIZE_TRANS_SIZE_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_ADAPTER_DMA_SCK.SCK_COUNT */
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_COUNT_TRANS_COUNT_Pos 0UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_COUNT_TRANS_COUNT_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_ADAPTER_DMA_SCK.SCK_STATUS */
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_AVL_COUNT_Pos 0UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_AVL_COUNT_Msk 0x1FUL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_AVL_MIN_Pos 5UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_AVL_MIN_Msk 0x3E0UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_AVL_ENABLE_Pos 10UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_AVL_ENABLE_Msk 0x400UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_SCK_ZLP_ALWAYS_Pos 11UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_SCK_ZLP_ALWAYS_Msk 0x800UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_STATE_Pos 15UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_STATE_Msk 0x38000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_ZLP_RCVD_Pos 18UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_ZLP_RCVD_Msk 0x40000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_SUSPENDED_Pos 19UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_SUSPENDED_Msk 0x80000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_ENABLED_Pos 20UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_ENABLED_Msk 0x100000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_TRUNCATE_Pos 21UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_TRUNCATE_Msk 0x200000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_EN_PROD_EVENTS_Pos 22UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_EN_PROD_EVENTS_Msk 0x400000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_EN_CONS_EVENTS_Pos 23UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_EN_CONS_EVENTS_Msk 0x800000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_SUSP_PARTIAL_Pos 24UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_SUSP_PARTIAL_Msk 0x1000000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_SUSP_LAST_Pos 25UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_SUSP_LAST_Msk 0x2000000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_SUSP_TRANS_Pos 26UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_SUSP_TRANS_Msk 0x4000000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_SUSP_EOP_Pos 27UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_SUSP_EOP_Msk 0x8000000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_WRAPUP_Pos 28UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_WRAPUP_Msk 0x10000000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_UNIT_Pos 29UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_UNIT_Msk 0x20000000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_GO_SUSPEND_Pos 30UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_GO_SUSPEND_Msk 0x40000000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_GO_ENABLE_Pos 31UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_STATUS_GO_ENABLE_Msk 0x80000000UL
/* LVDSSS_LVDS_ADAPTER_DMA_SCK.SCK_INTR */
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_PRODUCE_EVENT_Pos 0UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_PRODUCE_EVENT_Msk 0x1UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_CONSUME_EVENT_Pos 1UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_CONSUME_EVENT_Msk 0x2UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_DSCR_IS_LOW_Pos 2UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_DSCR_IS_LOW_Msk 0x4UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_DSCR_NOT_AVL_Pos 3UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_DSCR_NOT_AVL_Msk 0x8UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_STALL_Pos 4UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_STALL_Msk 0x10UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_SUSPEND_Pos 5UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_SUSPEND_Msk 0x20UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_ERROR_Pos 6UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_ERROR_Msk 0x40UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_TRANS_DONE_Pos 7UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_TRANS_DONE_Msk 0x80UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_PARTIAL_BUF_Pos 8UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_PARTIAL_BUF_Msk 0x100UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_LAST_BUF_Pos 9UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_LAST_BUF_Msk 0x200UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_EVENT_RCVD_Pos 10UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_EVENT_RCVD_Msk 0x400UL
/* LVDSSS_LVDS_ADAPTER_DMA_SCK.SCK_INTR_MASK */
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_MASK_PRODUCE_EVENT_Pos 0UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_MASK_PRODUCE_EVENT_Msk 0x1UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_MASK_CONSUME_EVENT_Pos 1UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_MASK_CONSUME_EVENT_Msk 0x2UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_MASK_DSCR_IS_LOW_Pos 2UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_MASK_DSCR_IS_LOW_Msk 0x4UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_MASK_DSCR_NOT_AVL_Pos 3UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_MASK_DSCR_NOT_AVL_Msk 0x8UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_MASK_STALL_Pos 4UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_MASK_STALL_Msk 0x10UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_MASK_SUSPEND_Pos 5UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_MASK_SUSPEND_Msk 0x20UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_MASK_ERROR_Pos 6UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_MASK_ERROR_Msk 0x40UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_MASK_TRANS_DONE_Pos 7UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_MASK_TRANS_DONE_Msk 0x80UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_MASK_PARTIAL_BUF_Pos 8UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_MASK_PARTIAL_BUF_Msk 0x100UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_MASK_LAST_BUF_Pos 9UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_MASK_LAST_BUF_Msk 0x200UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_MASK_EVENT_RCVD_Pos 10UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_INTR_MASK_EVENT_RCVD_Msk 0x400UL
/* LVDSSS_LVDS_ADAPTER_DMA_SCK.DSCR_BUFFER */
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_BUFFER_BUFFER_ADDR_Pos 0UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_BUFFER_BUFFER_ADDR_Msk 0x7FFFFFFFUL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_BUFFER_MARKER_Pos 31UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_BUFFER_MARKER_Msk 0x80000000UL
/* LVDSSS_LVDS_ADAPTER_DMA_SCK.DSCR_SYNC */
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SYNC_CONS_SCK_Pos 0UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SYNC_CONS_SCK_Msk 0xFFUL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SYNC_CONS_IP_Pos 8UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SYNC_CONS_IP_Msk 0x3F00UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SYNC_EN_CONS_EVENT_Pos 14UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SYNC_EN_CONS_EVENT_Msk 0x4000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SYNC_EN_CONS_INT_Pos 15UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SYNC_EN_CONS_INT_Msk 0x8000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SYNC_PROD_SCK_Pos 16UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SYNC_PROD_SCK_Msk 0xFF0000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SYNC_PROD_IP_Pos 24UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SYNC_PROD_IP_Msk 0x3F000000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SYNC_EN_PROD_EVENT_Pos 30UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SYNC_EN_PROD_EVENT_Msk 0x40000000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SYNC_EN_PROD_INT_Pos 31UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SYNC_EN_PROD_INT_Msk 0x80000000UL
/* LVDSSS_LVDS_ADAPTER_DMA_SCK.DSCR_CHAIN */
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_CHAIN_RD_NEXT_DSCR_Pos 0UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_CHAIN_RD_NEXT_DSCR_Msk 0xFFFFUL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_CHAIN_WR_NEXT_DSCR_Pos 16UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_CHAIN_WR_NEXT_DSCR_Msk 0xFFFF0000UL
/* LVDSSS_LVDS_ADAPTER_DMA_SCK.DSCR_SIZE */
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SIZE_BYTE_COUNT_MSB_Pos 0UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SIZE_BYTE_COUNT_MSB_Msk 0x1UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SIZE_EOP_Pos 1UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SIZE_EOP_Msk 0x2UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SIZE_BUFFER_ERROR_Pos 2UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SIZE_BUFFER_ERROR_Msk 0x4UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SIZE_BUFFER_OCCUPIED_Pos 3UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SIZE_BUFFER_OCCUPIED_Msk 0x8UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SIZE_BUFFER_SIZE_Pos 4UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SIZE_BUFFER_SIZE_Msk 0xFFF0UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SIZE_BYTE_COUNT_Pos 16UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_DSCR_SIZE_BYTE_COUNT_Msk 0xFFFF0000UL
/* LVDSSS_LVDS_ADAPTER_DMA_SCK.EVENT */
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_EVENT_ACTIVE_DSCR_Pos 0UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_EVENT_ACTIVE_DSCR_Msk 0xFFFFUL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_EVENT_EVENT_TYPE_Pos 16UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_EVENT_EVENT_TYPE_Msk 0x10000UL


