RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_lvdsss.h
/* LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL.SCK_INTR */
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_SCK_INTR_SCKINTR_Pos 0UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_SCK_INTR_SCKINTR_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL.ADAPTER_CTRL */
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_ADAPTER_EN_Pos 0UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_ADAPTER_EN_Msk 0x1UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_ADAP_DATA_WR_PRIO_Pos 4UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_ADAP_DATA_WR_PRIO_Msk 0x10UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_ADAP_DATA_RD_PRIO_Pos 5UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_ADAP_DATA_RD_PRIO_Msk 0x20UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_ADAP_DESC_WR_PRIO_N_Pos 6UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_ADAP_DESC_WR_PRIO_N_Msk 0x40UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_ADAP_DESC_RD_PRIO_N_Pos 7UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_ADAP_DESC_RD_PRIO_N_Msk 0x80UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_SUSP_PARTIAL_NO_EVT_N_Pos 10UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_SUSP_PARTIAL_NO_EVT_N_Msk 0x400UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_FQ_DEPTH_CTRL_Pos 12UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_FQ_DEPTH_CTRL_Msk 0x3F000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_DEBUG_CAPTURE_Pos 20UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_DEBUG_CAPTURE_Msk 0x100000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_EN_UNALIGNED_READ_N_Pos 21UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_EN_UNALIGNED_READ_N_Msk 0x200000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_TR_OUT_DELAY_Pos 24UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CTRL_TR_OUT_DELAY_Msk 0x3F000000UL
/* LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL.ADAPTER_DEBUG */
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_TS_COUNT_Pos 0UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_TS_COUNT_Msk 0xFUL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_TS_STATE_Pos 4UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_TS_STATE_Msk 0x70UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_TS_ID_Pos 7UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_TS_ID_Msk 0x1F80UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_SS_COUNT_Pos 13UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_SS_COUNT_Msk 0x3FE000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_SS_STATE_Pos 22UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_SS_STATE_Msk 0x400000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_SS_ID_Pos 23UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_SS_ID_Msk 0x1F800000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_TS_ABORT_Pos 29UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_TS_ABORT_Msk 0x20000000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_BS_STATE_Pos 30UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_DEBUG_BS_STATE_Msk 0xC0000000UL
/* LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL.ADAPTER_CONF */
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_SOCKET_ACTIVE_THRSHLD_Pos 0UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_SOCKET_ACTIVE_THRSHLD_Msk 0x3FUL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_STREAM_COUNT_Pos 6UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_STREAM_COUNT_Msk 0x7FC0UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_STREAMING_MODE_Pos 15UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_STREAMING_MODE_Msk 0x8000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_TS_CYCLES_Pos 16UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_TS_CYCLES_Msk 0xF0000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_ES_CYCLES_Pos 20UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_ES_CYCLES_Msk 0xF00000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_GBL_CYCLES_Pos 24UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_GBL_CYCLES_Msk 0xF000000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_MMIO_LOW_PRIORITY_Pos 28UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_MMIO_LOW_PRIORITY_Msk 0x10000000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_SWITCH_HIGH_PRIORITY_Pos 29UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_SWITCH_HIGH_PRIORITY_Msk 0x20000000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_TS_ABORT_EN_Pos 30UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_TS_ABORT_EN_Msk 0x40000000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_DESCR_PF_EN_N_Pos 31UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_CONF_DESCR_PF_EN_N_Msk 0x80000000UL
/* LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL.ADAPTER_STATUS */
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_STATUS_TTL_SOCKETS_Pos 0UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_STATUS_TTL_SOCKETS_Msk 0xFFUL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_STATUS_IG_ONLY_Pos 8UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_STATUS_IG_ONLY_Msk 0xFF00UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_STATUS_FQ_SIZE_Pos 16UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_STATUS_FQ_SIZE_Msk 0x1FF0000UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_STATUS_WORD_SIZE_Pos 25UL
#define LVDSSS_LVDS_ADAPTER_DMA_SCK_GBL_ADAPTER_STATUS_WORD_SIZE_Msk 0x6000000UL


/* LVDSSS_LVDS.CTL */
#define LVDSSS_LVDS_CTL_PHY_ENABLED_Pos         0UL
#define LVDSSS_LVDS_CTL_PHY_ENABLED_Msk         0x1UL
#define LVDSSS_LVDS_CTL_LINK_ENABLED_Pos        1UL
#define LVDSSS_LVDS_CTL_LINK_ENABLED_Msk        0x2UL
#define LVDSSS_LVDS_CTL_DMA_ENABLED_Pos         2UL
#define LVDSSS_LVDS_CTL_DMA_ENABLED_Msk         0x4UL
#define LVDSSS_LVDS_CTL_IP_ENABLED_Pos          31UL
#define LVDSSS_LVDS_CTL_IP_ENABLED_Msk          0x80000000UL
/* LVDSSS_LVDS.LINK_CONFIG */
#define LVDSSS_LVDS_LINK_CONFIG_LVDS_MODE_Pos   0UL
#define LVDSSS_LVDS_LINK_CONFIG_LVDS_MODE_Msk   0x1UL
#define LVDSSS_LVDS_LINK_CONFIG_GEARING_RATIO_Pos 1UL
#define LVDSSS_LVDS_LINK_CONFIG_GEARING_RATIO_Msk 0x6UL
#define LVDSSS_LVDS_LINK_CONFIG_WIDE_LINK_Pos   3UL
#define LVDSSS_LVDS_LINK_CONFIG_WIDE_LINK_Msk   0x8UL
#define LVDSSS_LVDS_LINK_CONFIG_NUM_LANES_Pos   4UL
#define LVDSSS_LVDS_LINK_CONFIG_NUM_LANES_Msk   0xF0UL
#define LVDSSS_LVDS_LINK_CONFIG_TWO_BIT_SLV_FF_Pos 8UL
#define LVDSSS_LVDS_LINK_CONFIG_TWO_BIT_SLV_FF_Msk 0x100UL
#define LVDSSS_LVDS_LINK_CONFIG_LINK_ENABLE_Pos 15UL
#define LVDSSS_LVDS_LINK_CONFIG_LINK_ENABLE_Msk 0x8000UL
#define LVDSSS_LVDS_LINK_CONFIG_BYPASS_DDR_PHY_Pos 16UL
#define LVDSSS_LVDS_LINK_CONFIG_BYPASS_DDR_PHY_Msk 0x10000UL
/* LVDSSS_LVDS.THREAD_INTLV_CTL */
#define LVDSSS_LVDS_THREAD_INTLV_CTL_TH0_TH1_INTERLEAVED_Pos 0UL
#define LVDSSS_LVDS_THREAD_INTLV_CTL_TH0_TH1_INTERLEAVED_Msk 0x1UL
#define LVDSSS_LVDS_THREAD_INTLV_CTL_TH2_TH3_INTERLEAVED_Pos 1UL
#define LVDSSS_LVDS_THREAD_INTLV_CTL_TH2_TH3_INTERLEAVED_Msk 0x2UL
/* LVDSSS_LVDS.LVDS_INTR_WD0 */
#define LVDSSS_LVDS_LVDS_INTR_WD0_GPIF0_INTERRUPT_Pos 0UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_GPIF0_INTERRUPT_Msk 0x1UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_GPIF1_INTERRUPT_Pos 1UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_GPIF1_INTERRUPT_Msk 0x2UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_PHY_LINK0_INTERRUPT_Pos 2UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_PHY_LINK0_INTERRUPT_Msk 0x4UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_PHY_LINK1_INTERRUPT_Pos 3UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_PHY_LINK1_INTERRUPT_Msk 0x8UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_THREAD0_ERR_Pos 4UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_THREAD0_ERR_Msk 0x10UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_THREAD1_ERR_Pos 5UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_THREAD1_ERR_Msk 0x20UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_THREAD2_ERR_Pos 6UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_THREAD2_ERR_Msk 0x40UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_THREAD3_ERR_Pos 7UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_THREAD3_ERR_Msk 0x80UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK0_FF_OVER_FLOW_Pos 8UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK0_FF_OVER_FLOW_Msk 0x100UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK1_FF_OVER_FLOW_Pos 9UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK1_FF_OVER_FLOW_Msk 0x200UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK0_TRAINING_DONE_Pos 10UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK0_TRAINING_DONE_Msk 0x400UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK1_TRAINING_DONE_Pos 11UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK1_TRAINING_DONE_Msk 0x800UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK0_TRAINING_BLK_DETECTED_Pos 12UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK0_TRAINING_BLK_DETECTED_Msk 0x1000UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK1_TRAINING_BLK_DETECTED_Pos 13UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK1_TRAINING_BLK_DETECTED_Msk 0x2000UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK0_TRAINING_BLK_DET_FAILD_Pos 14UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK0_TRAINING_BLK_DET_FAILD_Msk 0x4000UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK1_TRAINING_BLK_DET_FAILD_Pos 15UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK1_TRAINING_BLK_DET_FAILD_Msk 0x8000UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_THREAD0_DATA_CRC_ERR_Pos 16UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_THREAD0_DATA_CRC_ERR_Msk 0x10000UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_THREAD1_DATA_CRC_ERR_Pos 17UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_THREAD1_DATA_CRC_ERR_Msk 0x20000UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_THREAD2_DATA_CRC_ERR_Pos 18UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_THREAD2_DATA_CRC_ERR_Msk 0x40000UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_THREAD3_DATA_CRC_ERR_Pos 19UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_THREAD3_DATA_CRC_ERR_Msk 0x80000UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK0_L1_ENTRY_Pos 26UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK0_L1_ENTRY_Msk 0x4000000UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK1_L1_ENTRY_Pos 27UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK1_L1_ENTRY_Msk 0x8000000UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK0_L1_EXIT_Pos 28UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK0_L1_EXIT_Msk 0x10000000UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK1_L1_EXIT_Pos 29UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK1_L1_EXIT_Msk 0x20000000UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK0_L3_ENTRY_Pos 30UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK0_L3_ENTRY_Msk 0x40000000UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK1_L3_ENTRY_Pos 31UL
#define LVDSSS_LVDS_LVDS_INTR_WD0_LNK1_L3_ENTRY_Msk 0x80000000UL
/* LVDSSS_LVDS.LVDS_INTR_WD1 */
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH0_HDR_FLGS_CLR_BIT0_Pos 0UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH0_HDR_FLGS_CLR_BIT0_Msk 0x1UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH0_HDR_FLGS_CLR_BIT1_Pos 1UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH0_HDR_FLGS_CLR_BIT1_Msk 0x2UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH0_HDR_FLGS_CLR_BIT2_Pos 2UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH0_HDR_FLGS_CLR_BIT2_Msk 0x4UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH0_HDR_FLGS_CLR_BIT3_Pos 3UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH0_HDR_FLGS_CLR_BIT3_Msk 0x8UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH1_HDR_FLGS_CLR_BIT0_Pos 4UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH1_HDR_FLGS_CLR_BIT0_Msk 0x10UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH1_HDR_FLGS_CLR_BIT1_Pos 5UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH1_HDR_FLGS_CLR_BIT1_Msk 0x20UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH1_HDR_FLGS_CLR_BIT2_Pos 6UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH1_HDR_FLGS_CLR_BIT2_Msk 0x40UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH1_HDR_FLGS_CLR_BIT3_Pos 7UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH1_HDR_FLGS_CLR_BIT3_Msk 0x80UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH2_HDR_FLGS_CLR_BIT0_Pos 8UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH2_HDR_FLGS_CLR_BIT0_Msk 0x100UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH2_HDR_FLGS_CLR_BIT1_Pos 9UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH2_HDR_FLGS_CLR_BIT1_Msk 0x200UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH2_HDR_FLGS_CLR_BIT2_Pos 10UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH2_HDR_FLGS_CLR_BIT2_Msk 0x400UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH2_HDR_FLGS_CLR_BIT3_Pos 11UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH2_HDR_FLGS_CLR_BIT3_Msk 0x800UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH3_HDR_FLGS_CLR_BIT0_Pos 12UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH3_HDR_FLGS_CLR_BIT0_Msk 0x1000UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH3_HDR_FLGS_CLR_BIT1_Pos 13UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH3_HDR_FLGS_CLR_BIT1_Msk 0x2000UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH3_HDR_FLGS_CLR_BIT2_Pos 14UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH3_HDR_FLGS_CLR_BIT2_Msk 0x4000UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH3_HDR_FLGS_CLR_BIT3_Pos 15UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH3_HDR_FLGS_CLR_BIT3_Msk 0x8000UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH0_HDR_FLGS_SET_BIT0_Pos 16UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH0_HDR_FLGS_SET_BIT0_Msk 0x10000UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH0_HDR_FLGS_SET_BIT1_Pos 17UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH0_HDR_FLGS_SET_BIT1_Msk 0x20000UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH0_HDR_FLGS_SET_BIT2_Pos 18UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH0_HDR_FLGS_SET_BIT2_Msk 0x40000UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH0_HDR_FLGS_SET_BIT3_Pos 19UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH0_HDR_FLGS_SET_BIT3_Msk 0x80000UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH1_HDR_FLGS_SET_BIT0_Pos 20UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH1_HDR_FLGS_SET_BIT0_Msk 0x100000UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH1_HDR_FLGS_SET_BIT1_Pos 21UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH1_HDR_FLGS_SET_BIT1_Msk 0x200000UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH1_HDR_FLGS_SET_BIT2_Pos 22UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH1_HDR_FLGS_SET_BIT2_Msk 0x400000UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH1_HDR_FLGS_SET_BIT3_Pos 23UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH1_HDR_FLGS_SET_BIT3_Msk 0x800000UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH2_HDR_FLGS_SET_BIT0_Pos 24UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH2_HDR_FLGS_SET_BIT0_Msk 0x1000000UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH2_HDR_FLGS_SET_BIT1_Pos 25UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH2_HDR_FLGS_SET_BIT1_Msk 0x2000000UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH2_HDR_FLGS_SET_BIT2_Pos 26UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH2_HDR_FLGS_SET_BIT2_Msk 0x4000000UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH2_HDR_FLGS_SET_BIT3_Pos 27UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH2_HDR_FLGS_SET_BIT3_Msk 0x8000000UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH3_HDR_FLGS_SET_BIT0_Pos 28UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH3_HDR_FLGS_SET_BIT0_Msk 0x10000000UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH3_HDR_FLGS_SET_BIT1_Pos 29UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH3_HDR_FLGS_SET_BIT1_Msk 0x20000000UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH3_HDR_FLGS_SET_BIT2_Pos 30UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH3_HDR_FLGS_SET_BIT2_Msk 0x40000000UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH3_HDR_FLGS_SET_BIT3_Pos 31UL
#define LVDSSS_LVDS_LVDS_INTR_WD1_TH3_HDR_FLGS_SET_BIT3_Msk 0x80000000UL
/* LVDSSS_LVDS.LVDS_INTR_MASK_WD0 */
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_GPIF0_INTERRUPT_Pos 0UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_GPIF0_INTERRUPT_Msk 0x1UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_GPIF1_INTERRUPT_Pos 1UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_GPIF1_INTERRUPT_Msk 0x2UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_PHY_LINK0_INTERRUPT_Pos 2UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_PHY_LINK0_INTERRUPT_Msk 0x4UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_PHY_LINK1_INTERRUPT_Pos 3UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_PHY_LINK1_INTERRUPT_Msk 0x8UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_THREAD0_ERR_Pos 4UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_THREAD0_ERR_Msk 0x10UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_THREAD1_ERR_Pos 5UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_THREAD1_ERR_Msk 0x20UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_THREAD2_ERR_Pos 6UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_THREAD2_ERR_Msk 0x40UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_THREAD3_ERR_Pos 7UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_THREAD3_ERR_Msk 0x80UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK0_FF_OVER_FLOW_Pos 8UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK0_FF_OVER_FLOW_Msk 0x100UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK1_FF_OVER_FLOW_Pos 9UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK1_FF_OVER_FLOW_Msk 0x200UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK0_TRAINING_DONE_Pos 10UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK0_TRAINING_DONE_Msk 0x400UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK1_TRAINING_DONE_Pos 11UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK1_TRAINING_DONE_Msk 0x800UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK0_TRAINING_BLK_DETECTED_Pos 12UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK0_TRAINING_BLK_DETECTED_Msk 0x1000UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK1_TRAINING_BLK_DETECTED_Pos 13UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK1_TRAINING_BLK_DETECTED_Msk 0x2000UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK0_TRAINING_BLK_DET_FAILD_Pos 14UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK0_TRAINING_BLK_DET_FAILD_Msk 0x4000UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK1_TRAINING_BLK_DET_FAILD_Pos 15UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK1_TRAINING_BLK_DET_FAILD_Msk 0x8000UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_THREAD0_DATA_CRC_ERR_Pos 16UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_THREAD0_DATA_CRC_ERR_Msk 0x10000UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_THREAD1_DATA_CRC_ERR_Pos 17UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_THREAD1_DATA_CRC_ERR_Msk 0x20000UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_THREAD2_DATA_CRC_ERR_Pos 18UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_THREAD2_DATA_CRC_ERR_Msk 0x40000UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_THREAD3_DATA_CRC_ERR_Pos 19UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_THREAD3_DATA_CRC_ERR_Msk 0x80000UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK0_L1_ENTRY_Pos 26UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK0_L1_ENTRY_Msk 0x4000000UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK1_L1_ENTRY_Pos 27UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK1_L1_ENTRY_Msk 0x8000000UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK0_L1_EXIT_Pos 28UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK0_L1_EXIT_Msk 0x10000000UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK1_L1_EXIT_Pos 29UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK1_L1_EXIT_Msk 0x20000000UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK0_L3_ENTRY_Pos 30UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK0_L3_ENTRY_Msk 0x40000000UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK1_L3_ENTRY_Pos 31UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD0_LNK1_L3_ENTRY_Msk 0x80000000UL
/* LVDSSS_LVDS.LVDS_INTR_MASK_WD1 */
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD1_TH0_HDR_FLGS_CLR_Pos 0UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD1_TH0_HDR_FLGS_CLR_Msk 0xFUL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD1_TH1_HDR_FLGS_CLR_Pos 4UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD1_TH1_HDR_FLGS_CLR_Msk 0xF0UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD1_TH2_HDR_FLGS_CLR_Pos 8UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD1_TH2_HDR_FLGS_CLR_Msk 0xF00UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD1_TH3_HDR_FLGS_CLR_Pos 12UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD1_TH3_HDR_FLGS_CLR_Msk 0xF000UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD1_TH0_HDR_FLGS_SET_Pos 16UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD1_TH0_HDR_FLGS_SET_Msk 0xF0000UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD1_TH1_HDR_FLGS_SET_Pos 20UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD1_TH1_HDR_FLGS_SET_Msk 0xF00000UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD1_TH2_HDR_FLGS_SET_Pos 24UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD1_TH2_HDR_FLGS_SET_Msk 0xF000000UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD1_TH3_HDR_FLGS_SET_Pos 28UL
#define LVDSSS_LVDS_LVDS_INTR_MASK_WD1_TH3_HDR_FLGS_SET_Msk 0xF0000000UL
/* LVDSSS_LVDS.LVDS_INTR_MASKED_WD0 */
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_GPIF0_INTERRUPT_Pos 0UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_GPIF0_INTERRUPT_Msk 0x1UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_GPIF1_INTERRUPT_Pos 1UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_GPIF1_INTERRUPT_Msk 0x2UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_PHY_LINK0_INTERRUPT_Pos 2UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_PHY_LINK0_INTERRUPT_Msk 0x4UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_PHY_LINK1_INTERRUPT_Pos 3UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_PHY_LINK1_INTERRUPT_Msk 0x8UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_THREAD0_ERR_Pos 4UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_THREAD0_ERR_Msk 0x10UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_THREAD1_ERR_Pos 5UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_THREAD1_ERR_Msk 0x20UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_THREAD2_ERR_Pos 6UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_THREAD2_ERR_Msk 0x40UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_THREAD3_ERR_Pos 7UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_THREAD3_ERR_Msk 0x80UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK0_FF_OVER_FLOW_Pos 8UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK0_FF_OVER_FLOW_Msk 0x100UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK1_FF_OVER_FLOW_Pos 9UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK1_FF_OVER_FLOW_Msk 0x200UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK0_TRAINING_DONE_Pos 10UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK0_TRAINING_DONE_Msk 0x400UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK1_TRAINING_DONE_Pos 11UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK1_TRAINING_DONE_Msk 0x800UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK0_TRAINING_BLK_DETECTED_Pos 12UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK0_TRAINING_BLK_DETECTED_Msk 0x1000UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK1_TRAINING_BLK_DETECTED_Pos 13UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK1_TRAINING_BLK_DETECTED_Msk 0x2000UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK0_TRAINING_BLK_DET_FAILD_Pos 14UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK0_TRAINING_BLK_DET_FAILD_Msk 0x4000UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK1_TRAINING_BLK_DET_FAILD_Pos 15UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK1_TRAINING_BLK_DET_FAILD_Msk 0x8000UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_THREAD0_DATA_CRC_ERR_Pos 16UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_THREAD0_DATA_CRC_ERR_Msk 0x10000UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_THREAD1_DATA_CRC_ERR_Pos 17UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_THREAD1_DATA_CRC_ERR_Msk 0x20000UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_THREAD2_DATA_CRC_ERR_Pos 18UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_THREAD2_DATA_CRC_ERR_Msk 0x40000UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_THREAD3_DATA_CRC_ERR_Pos 19UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_THREAD3_DATA_CRC_ERR_Msk 0x80000UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK0_L1_ENTRY_Pos 26UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK0_L1_ENTRY_Msk 0x4000000UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK1_L1_ENTRY_Pos 27UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK1_L1_ENTRY_Msk 0x8000000UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK0_L1_EXIT_Pos 28UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK0_L1_EXIT_Msk 0x10000000UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK1_L1_EXIT_Pos 29UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK1_L1_EXIT_Msk 0x20000000UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK0_L3_ENTRY_Pos 30UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK0_L3_ENTRY_Msk 0x40000000UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK1_L3_ENTRY_Pos 31UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD0_LNK1_L3_ENTRY_Msk 0x80000000UL
/* LVDSSS_LVDS.LVDS_INTR_MASKED_WD1 */
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD1_TH0_HDR_FLGS_CLR_Pos 0UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD1_TH0_HDR_FLGS_CLR_Msk 0xFUL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD1_TH1_HDR_FLGS_CLR_Pos 4UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD1_TH1_HDR_FLGS_CLR_Msk 0xF0UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD1_TH2_HDR_FLGS_CLR_Pos 8UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD1_TH2_HDR_FLGS_CLR_Msk 0xF00UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD1_TH3_HDR_FLGS_CLR_Pos 12UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD1_TH3_HDR_FLGS_CLR_Msk 0xF000UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD1_TH0_HDR_FLGS_SET_Pos 16UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD1_TH0_HDR_FLGS_SET_Msk 0xF0000UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD1_TH1_HDR_FLGS_SET_Pos 20UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD1_TH1_HDR_FLGS_SET_Msk 0xF00000UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD1_TH2_HDR_FLGS_SET_Pos 24UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD1_TH2_HDR_FLGS_SET_Msk 0xF000000UL
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD1_TH3_HDR_FLGS_SET_Pos 28UL
