RIOT-OS/RIOT/cpu/psoc6/include/vendor/ip/cyip_lvdsss.h
#define LVDSSS_LVDS_LVDS_INTR_MASKED_WD1_TH3_HDR_FLGS_SET_Msk 0xF0000000UL
/* LVDSSS_LVDS.LVDS_INTR_SET_WD0 */
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_THREAD0_ERR_Pos 4UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_THREAD0_ERR_Msk 0x10UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_THREAD1_ERR_Pos 5UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_THREAD1_ERR_Msk 0x20UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_THREAD2_ERR_Pos 6UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_THREAD2_ERR_Msk 0x40UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_THREAD3_ERR_Pos 7UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_THREAD3_ERR_Msk 0x80UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK0_FF_OVER_FLOW_Pos 8UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK0_FF_OVER_FLOW_Msk 0x100UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK1_FF_OVER_FLOW_Pos 9UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK1_FF_OVER_FLOW_Msk 0x200UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK0_TRAINING_DONE_Pos 10UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK0_TRAINING_DONE_Msk 0x400UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK1_TRAINING_DONE_Pos 11UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK1_TRAINING_DONE_Msk 0x800UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK0_TRAINING_BLK_DETECTED_Pos 12UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK0_TRAINING_BLK_DETECTED_Msk 0x1000UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK1_TRAINING_BLK_DETECTED_Pos 13UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK1_TRAINING_BLK_DETECTED_Msk 0x2000UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK0_TRAINING_BLK_DET_FAILD_Pos 14UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK0_TRAINING_BLK_DET_FAILD_Msk 0x4000UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK1_TRAINING_BLK_DET_FAILD_Pos 15UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK1_TRAINING_BLK_DET_FAILD_Msk 0x8000UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_THREAD0_DATA_CRC_ERR_Pos 16UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_THREAD0_DATA_CRC_ERR_Msk 0x10000UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_THREAD1_DATA_CRC_ERR_Pos 17UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_THREAD1_DATA_CRC_ERR_Msk 0x20000UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_THREAD2_DATA_CRC_ERR_Pos 18UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_THREAD2_DATA_CRC_ERR_Msk 0x40000UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_THREAD3_DATA_CRC_ERR_Pos 19UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_THREAD3_DATA_CRC_ERR_Msk 0x80000UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK0_L1_ENTRY_Pos 26UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK0_L1_ENTRY_Msk 0x4000000UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK1_L1_ENTRY_Pos 27UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK1_L1_ENTRY_Msk 0x8000000UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK0_L1_EXIT_Pos 28UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK0_L1_EXIT_Msk 0x10000000UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK1_L1_EXIT_Pos 29UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK1_L1_EXIT_Msk 0x20000000UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK0_L3_ENTRY_Pos 30UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK0_L3_ENTRY_Msk 0x40000000UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK1_L3_ENTRY_Pos 31UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD0_LNK1_L3_ENTRY_Msk 0x80000000UL
/* LVDSSS_LVDS.LVDS_INTR_SET_WD1 */
#define LVDSSS_LVDS_LVDS_INTR_SET_WD1_TH0_HDR_FLGS_CLR_Pos 0UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD1_TH0_HDR_FLGS_CLR_Msk 0xFUL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD1_TH1_HDR_FLGS_CLR_Pos 4UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD1_TH1_HDR_FLGS_CLR_Msk 0xF0UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD1_TH2_HDR_FLGS_CLR_Pos 8UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD1_TH2_HDR_FLGS_CLR_Msk 0xF00UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD1_TH3_HDR_FLGS_CLR_Pos 12UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD1_TH3_HDR_FLGS_CLR_Msk 0xF000UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD1_TH0_HDR_FLGS_SET_Pos 16UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD1_TH0_HDR_FLGS_SET_Msk 0xF0000UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD1_TH1_HDR_FLGS_SET_Pos 20UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD1_TH1_HDR_FLGS_SET_Msk 0xF00000UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD1_TH2_HDR_FLGS_SET_Pos 24UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD1_TH2_HDR_FLGS_SET_Msk 0xF000000UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD1_TH3_HDR_FLGS_SET_Pos 28UL
#define LVDSSS_LVDS_LVDS_INTR_SET_WD1_TH3_HDR_FLGS_SET_Msk 0xF0000000UL
/* LVDSSS_LVDS.LVDS_ERROR */
#define LVDSSS_LVDS_LVDS_ERROR_THREAD0_ERR_CODE_Pos 0UL
#define LVDSSS_LVDS_LVDS_ERROR_THREAD0_ERR_CODE_Msk 0xFUL
#define LVDSSS_LVDS_LVDS_ERROR_THREAD1_ERR_CODE_Pos 4UL
#define LVDSSS_LVDS_LVDS_ERROR_THREAD1_ERR_CODE_Msk 0xF0UL
#define LVDSSS_LVDS_LVDS_ERROR_THREAD2_ERR_CODE_Pos 8UL
#define LVDSSS_LVDS_LVDS_ERROR_THREAD2_ERR_CODE_Msk 0xF00UL
#define LVDSSS_LVDS_LVDS_ERROR_THREAD3_ERR_CODE_Pos 12UL
#define LVDSSS_LVDS_LVDS_ERROR_THREAD3_ERR_CODE_Msk 0xF000UL
/* LVDSSS_LVDS.LVDS_EOP_EOT */
#define LVDSSS_LVDS_LVDS_EOP_EOT_EOP_EOT_CFG_Pos 0UL
#define LVDSSS_LVDS_LVDS_EOP_EOT_EOP_EOT_CFG_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS.LANE_FIFO_STS */
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE0_FF_OVERFLOW_Pos 0UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE0_FF_OVERFLOW_Msk 0x1UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE1_FF_OVERFLOW_Pos 1UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE1_FF_OVERFLOW_Msk 0x2UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE2_FF_OVERFLOW_Pos 2UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE2_FF_OVERFLOW_Msk 0x4UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE3_FF_OVERFLOW_Pos 3UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE3_FF_OVERFLOW_Msk 0x8UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE4_FF_OVERFLOW_Pos 4UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE4_FF_OVERFLOW_Msk 0x10UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE5_FF_OVERFLOW_Pos 5UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE5_FF_OVERFLOW_Msk 0x20UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE6_FF_OVERFLOW_Pos 6UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE6_FF_OVERFLOW_Msk 0x40UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE7_FF_OVERFLOW_Pos 7UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE7_FF_OVERFLOW_Msk 0x80UL
#define LVDSSS_LVDS_LANE_FIFO_STS_CTRL_LANE_FF_OVERFLOW_Pos 8UL
#define LVDSSS_LVDS_LANE_FIFO_STS_CTRL_LANE_FF_OVERFLOW_Msk 0x100UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE0_FF_UNDERFLOW_Pos 16UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE0_FF_UNDERFLOW_Msk 0x10000UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE1_FF_UNDERFLOW_Pos 17UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE1_FF_UNDERFLOW_Msk 0x20000UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE2_FF_UNDERFLOW_Pos 18UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE2_FF_UNDERFLOW_Msk 0x40000UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE3_FF_UNDERFLOW_Pos 19UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE3_FF_UNDERFLOW_Msk 0x80000UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE4_FF_UNDERFLOW_Pos 20UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE4_FF_UNDERFLOW_Msk 0x100000UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE5_FF_UNDERFLOW_Pos 21UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE5_FF_UNDERFLOW_Msk 0x200000UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE6_FF_UNDERFLOW_Pos 22UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE6_FF_UNDERFLOW_Msk 0x400000UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE7_FF_UNDERFLOW_Pos 23UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LANE7_FF_UNDERFLOW_Msk 0x800000UL
#define LVDSSS_LVDS_LANE_FIFO_STS_CTRL_LANE_FF_UNDERFLOW_Pos 24UL
#define LVDSSS_LVDS_LANE_FIFO_STS_CTRL_LANE_FF_UNDERFLOW_Msk 0x1000000UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LNK_FF_UNDERFLOW_Pos 31UL
#define LVDSSS_LVDS_LANE_FIFO_STS_LNK_FF_UNDERFLOW_Msk 0x80000000UL
/* LVDSSS_LVDS.GPIF_CLK_SEL */
#define LVDSSS_LVDS_GPIF_CLK_SEL_GPIF_CLK_SRC_Pos 0UL
#define LVDSSS_LVDS_GPIF_CLK_SEL_GPIF_CLK_SRC_Msk 0x3UL
#define LVDSSS_LVDS_GPIF_CLK_SEL_USB_CLK_DIV_VAL_Pos 2UL
#define LVDSSS_LVDS_GPIF_CLK_SEL_USB_CLK_DIV_VAL_Msk 0xCUL
#define LVDSSS_LVDS_GPIF_CLK_SEL_GATE_WAVEFORM_MEM_CLK_Pos 4UL
#define LVDSSS_LVDS_GPIF_CLK_SEL_GATE_WAVEFORM_MEM_CLK_Msk 0x10UL
#define LVDSSS_LVDS_GPIF_CLK_SEL_LVCMOS_IF_CLK_100MHZ_Pos 5UL
#define LVDSSS_LVDS_GPIF_CLK_SEL_LVCMOS_IF_CLK_100MHZ_Msk 0x20UL
#define LVDSSS_LVDS_GPIF_CLK_SEL_WAVEFORM_RAM_CG_DURATION_Pos 8UL
#define LVDSSS_LVDS_GPIF_CLK_SEL_WAVEFORM_RAM_CG_DURATION_Msk 0xF00UL
/* LVDSSS_LVDS.USB_FRM_CNTR_CFG */
#define LVDSSS_LVDS_USB_FRM_CNTR_CFG_SEL_USB32_FRM_CNT_Pos 0UL
#define LVDSSS_LVDS_USB_FRM_CNTR_CFG_SEL_USB32_FRM_CNT_Msk 0x1UL
/* LVDSSS_LVDS.TIME_STAMP_CLK_DW0 */
#define LVDSSS_LVDS_TIME_STAMP_CLK_DW0_TS_WD0_Pos 0UL
#define LVDSSS_LVDS_TIME_STAMP_CLK_DW0_TS_WD0_Msk 0xFFFFUL
#define LVDSSS_LVDS_TIME_STAMP_CLK_DW0_TS_WD1_Pos 16UL
#define LVDSSS_LVDS_TIME_STAMP_CLK_DW0_TS_WD1_Msk 0xFFFF0000UL
/* LVDSSS_LVDS.TIME_STAMP_CLK_DW1 */
#define LVDSSS_LVDS_TIME_STAMP_CLK_DW1_TS_WD2_Pos 0UL
#define LVDSSS_LVDS_TIME_STAMP_CLK_DW1_TS_WD2_Msk 0xFFFFUL
#define LVDSSS_LVDS_TIME_STAMP_CLK_DW1_TS_WD3_Pos 16UL
#define LVDSSS_LVDS_TIME_STAMP_CLK_DW1_TS_WD3_Msk 0xFFFF0000UL
/* LVDSSS_LVDS.SCRSS_VALUE_CFG */
#define LVDSSS_LVDS_SCRSS_VALUE_CFG_TS_CNTR_BITS_4SCRSS_Pos 0UL
#define LVDSSS_LVDS_SCRSS_VALUE_CFG_TS_CNTR_BITS_4SCRSS_Msk 0x3UL
#define LVDSSS_LVDS_SCRSS_VALUE_CFG_BUS_INTRVL_BITS_4SCRSS_Pos 2UL
#define LVDSSS_LVDS_SCRSS_VALUE_CFG_BUS_INTRVL_BITS_4SCRSS_Msk 0xCUL
/* LVDSSS_LVDS.TRAINING_BLK_CFG */
#define LVDSSS_LVDS_TRAINING_BLK_CFG_ENABLE_LNK0_DESKEW_Pos 0UL
#define LVDSSS_LVDS_TRAINING_BLK_CFG_ENABLE_LNK0_DESKEW_Msk 0x1UL
#define LVDSSS_LVDS_TRAINING_BLK_CFG_ENABLE_LNK1_DESKEW_Pos 1UL
#define LVDSSS_LVDS_TRAINING_BLK_CFG_ENABLE_LNK1_DESKEW_Msk 0x2UL
/* LVDSSS_LVDS.TRAINING_BLK */
#define LVDSSS_LVDS_TRAINING_BLK_TRAINING_BLK_BYT0_Pos 0UL
#define LVDSSS_LVDS_TRAINING_BLK_TRAINING_BLK_BYT0_Msk 0xFFUL
#define LVDSSS_LVDS_TRAINING_BLK_TRAINING_BLK_BYT1_Pos 8UL
#define LVDSSS_LVDS_TRAINING_BLK_TRAINING_BLK_BYT1_Msk 0xFF00UL
#define LVDSSS_LVDS_TRAINING_BLK_TRAINING_BLK_BYT2_Pos 16UL
#define LVDSSS_LVDS_TRAINING_BLK_TRAINING_BLK_BYT2_Msk 0xFF0000UL
#define LVDSSS_LVDS_TRAINING_BLK_TRAINING_BLK_BYT3_Pos 24UL
#define LVDSSS_LVDS_TRAINING_BLK_TRAINING_BLK_BYT3_Msk 0xFF000000UL
/* LVDSSS_LVDS.LINK_TRAINING_STS */
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE0_TRAINING_BLK_DTCTD_Pos 0UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE0_TRAINING_BLK_DTCTD_Msk 0x1UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE1_TRAINING_BLK_DTCTD_Pos 1UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE1_TRAINING_BLK_DTCTD_Msk 0x2UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE2_TRAINING_BLK_DTCTD_Pos 2UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE2_TRAINING_BLK_DTCTD_Msk 0x4UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE3_TRAINING_BLK_DTCTD_Pos 3UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE3_TRAINING_BLK_DTCTD_Msk 0x8UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE4_TRAINING_BLK_DTCTD_Pos 4UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE4_TRAINING_BLK_DTCTD_Msk 0x10UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE5_TRAINING_BLK_DTCTD_Pos 5UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE5_TRAINING_BLK_DTCTD_Msk 0x20UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE6_TRAINING_BLK_DTCTD_Pos 6UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE6_TRAINING_BLK_DTCTD_Msk 0x40UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE7_TRAINING_BLK_DTCTD_Pos 7UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE7_TRAINING_BLK_DTCTD_Msk 0x80UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_CTRL_LANE_TRAINING_BLK_DTCTD_Pos 8UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_CTRL_LANE_TRAINING_BLK_DTCTD_Msk 0x100UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE0_TRAINING_BLK_DTCT_FAILED_Pos 16UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE0_TRAINING_BLK_DTCT_FAILED_Msk 0x10000UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE1_TRAINING_BLK_DTCT_FAILED_Pos 17UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE1_TRAINING_BLK_DTCT_FAILED_Msk 0x20000UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE2_TRAINING_BLK_DTCT_FAILED_Pos 18UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE2_TRAINING_BLK_DTCT_FAILED_Msk 0x40000UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE3_TRAINING_BLK_DTCT_FAILED_Pos 19UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE3_TRAINING_BLK_DTCT_FAILED_Msk 0x80000UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE4_TRAINING_BLK_DTCT_FAILED_Pos 20UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE4_TRAINING_BLK_DTCT_FAILED_Msk 0x100000UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE5_TRAINING_BLK_DTCT_FAILED_Pos 21UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE5_TRAINING_BLK_DTCT_FAILED_Msk 0x200000UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE6_TRAINING_BLK_DTCT_FAILED_Pos 22UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE6_TRAINING_BLK_DTCT_FAILED_Msk 0x400000UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE7_TRAINING_BLK_DTCT_FAILED_Pos 23UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_LANE7_TRAINING_BLK_DTCT_FAILED_Msk 0x800000UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_CTRL_LANE_TRAINING_BLK_DTCT_FAILED_Pos 24UL
#define LVDSSS_LVDS_LINK_TRAINING_STS_CTRL_LANE_TRAINING_BLK_DTCT_FAILED_Msk 0x1000000UL
/* LVDSSS_LVDS.DDFT_MUX_SEL */
#define LVDSSS_LVDS_DDFT_MUX_SEL_DDFT0_MUX_SEL_Pos 0UL
#define LVDSSS_LVDS_DDFT_MUX_SEL_DDFT0_MUX_SEL_Msk 0xFFFUL
#define LVDSSS_LVDS_DDFT_MUX_SEL_DDFT1_MUX_SEL_Pos 15UL
#define LVDSSS_LVDS_DDFT_MUX_SEL_DDFT1_MUX_SEL_Msk 0x7FF8000UL
/* LVDSSS_LVDS.GPIO_DDFT_MUX_SEL */
#define LVDSSS_LVDS_GPIO_DDFT_MUX_SEL_GPIO_DDFT0_MUX_SEL_Pos 0UL
#define LVDSSS_LVDS_GPIO_DDFT_MUX_SEL_GPIO_DDFT0_MUX_SEL_Msk 0xFFFUL
#define LVDSSS_LVDS_GPIO_DDFT_MUX_SEL_GPIO_DDFT1_MUX_SEL_Pos 15UL
#define LVDSSS_LVDS_GPIO_DDFT_MUX_SEL_GPIO_DDFT1_MUX_SEL_Msk 0x7FF8000UL
/* LVDSSS_LVDS.LOOPBACK_CFG */
#define LVDSSS_LVDS_LOOPBACK_CFG_LINK0_PUT_LNK1_TESTER_EN_Pos 0UL
#define LVDSSS_LVDS_LOOPBACK_CFG_LINK0_PUT_LNK1_TESTER_EN_Msk 0x1UL
#define LVDSSS_LVDS_LOOPBACK_CFG_LINK1_PUT_LNK0_TESTER_EN_Pos 1UL
#define LVDSSS_LVDS_LOOPBACK_CFG_LINK1_PUT_LNK0_TESTER_EN_Msk 0x2UL
/* LVDSSS_LVDS.LVDS_CHAR_CFG */
#define LVDSSS_LVDS_LVDS_CHAR_CFG_LVDS_DATA_LANE_EN_Pos 0UL
#define LVDSSS_LVDS_LVDS_CHAR_CFG_LVDS_DATA_LANE_EN_Msk 0xFFUL
#define LVDSSS_LVDS_LVDS_CHAR_CFG_LVDS_CTRL_LANE_EN_Pos 8UL
#define LVDSSS_LVDS_LVDS_CHAR_CFG_LVDS_CTRL_LANE_EN_Msk 0x100UL
#define LVDSSS_LVDS_LVDS_CHAR_CFG_LVDS_CHAR_EN_Pos 31UL
#define LVDSSS_LVDS_LVDS_CHAR_CFG_LVDS_CHAR_EN_Msk 0x80000000UL
/* LVDSSS_LVDS.CLK_GATE_DIS */
#define LVDSSS_LVDS_CLK_GATE_DIS_TH0_CLK_GATE_DISABLE_Pos 0UL
#define LVDSSS_LVDS_CLK_GATE_DIS_TH0_CLK_GATE_DISABLE_Msk 0x1UL
#define LVDSSS_LVDS_CLK_GATE_DIS_TH1_CLK_GATE_DISABLE_Pos 1UL
#define LVDSSS_LVDS_CLK_GATE_DIS_TH1_CLK_GATE_DISABLE_Msk 0x2UL
#define LVDSSS_LVDS_CLK_GATE_DIS_TH2_CLK_GATE_DISABLE_Pos 2UL
#define LVDSSS_LVDS_CLK_GATE_DIS_TH2_CLK_GATE_DISABLE_Msk 0x4UL
#define LVDSSS_LVDS_CLK_GATE_DIS_TH3_CLK_GATE_DISABLE_Pos 3UL
#define LVDSSS_LVDS_CLK_GATE_DIS_TH3_CLK_GATE_DISABLE_Msk 0x8UL
/* LVDSSS_LVDS.VERSION_SEL */
#define LVDSSS_LVDS_VERSION_SEL_A0_SEL_Pos      0UL
#define LVDSSS_LVDS_VERSION_SEL_A0_SEL_Msk      0x1UL
#define LVDSSS_LVDS_VERSION_SEL_SKEW_MONITOR_A0_SEL_Pos 1UL
#define LVDSSS_LVDS_VERSION_SEL_SKEW_MONITOR_A0_SEL_Msk 0x2UL
/* LVDSSS_LVDS.TH0_TH1_METADATA_RAM */
#define LVDSSS_LVDS_TH0_TH1_METADATA_RAM_METADATA_Pos 0UL
#define LVDSSS_LVDS_TH0_TH1_METADATA_RAM_METADATA_Msk 0xFFFFFFFFUL
/* LVDSSS_LVDS.TH2_TH3_METADATA_RAM */
#define LVDSSS_LVDS_TH2_TH3_METADATA_RAM_METADATA_Pos 0UL
#define LVDSSS_LVDS_TH2_TH3_METADATA_RAM_METADATA_Msk 0xFFFFFFFFUL


#endif /* _CYIP_LVDSSS_H_ */


/* [] END OF FILE */
